[
  {
    "n": 1,
    "title": "Role and Function of Network Components",
    "math": "Network topology",
    "note": "This lesson introduces the core hardware components of a network. It explains the function of routers (Layer 3), switches (Layer 2 and Layer 3), next-generation firewalls (NGFW), access points (APs), and endpoints. The context is a typical enterprise network environment."
  },
  {
    "n": 2,
    "title": "Network Topology Architectures",
    "math": "Graph theory",
    "note": "This section covers common network design blueprints. It compares and contrasts the traditional three-tier (core, distribution, access) and two-tier hierarchical architectures with the modern spine-leaf architecture used in data centers. WAN and SOHO (Small Office/Home Office) topologies are also discussed."
  },
  {
    "n": 3,
    "title": "Cabling and Physical Interfaces",
    "math": "Signal propagation",
    "note": "This lesson details the physical layer of networking. It covers different cabling types, including copper (e.g., Cat 5e, Cat 6) and fiber optic (single-mode, multi-mode), and explains their use cases. It also covers identifying and troubleshooting common cable issues like collisions, errors, and duplex mismatches."
  },
  {
    "n": 4,
    "title": "TCP vs. UDP",
    "math": "Transport protocols",
    "note": "This section compares the two primary transport layer protocols. It explains the key characteristics of TCP (connection-oriented, reliable, ordered delivery) and UDP (connectionless, best-effort delivery) and provides examples of applications that use each protocol. The concept of a three-way handshake for TCP is introduced."
  },
  {
    "n": 5,
    "title": "Binary and Hexadecimal Numbering",
    "math": "Base conversion",
    "note": "This lesson provides the mathematical foundation for IP addressing. It teaches how to convert between decimal, binary, and hexadecimal number systems, which is a critical skill for working with IPv4, IPv6, and MAC addresses."
  },
  {
    "n": 6,
    "title": "IPv4 Addressing and Subnetting",
    "math": "Boolean algebra, IP subnetting",
    "note": "This section provides a deep dive into IPv4 addressing. It covers the structure of an IPv4 address, the concept of a subnet mask, and the process of subnetting to create smaller networks. Students will learn to calculate network addresses, host ranges, and broadcast addresses for a given subnet."
  },
  {
    "n": 7,
    "title": "IPv6 Addressing Fundamentals",
    "math": "Hexadecimal arithmetic",
    "note": "This lesson introduces IPv6. It explains the 128-bit address format, hexadecimal notation, and rules for abbreviation. It also covers IPv6 address types, including global unicast, unique local, and link-local, and the process of configuring an address on a client OS."
  },
  {
    "n": 8,
    "title": "Introduction to VLANs",
    "math": "Set theory (segmentation)",
    "note": "This lesson introduces Virtual LANs (VLANs) as a mechanism to logically segment a physical network. It explains how VLANs can improve security and traffic management by creating separate broadcast domains on a single switch. The standard VLAN ranges are also covered."
  },
  {
    "n": 9,
    "title": "VLAN Trunking with 802.1Q",
    "math": "Frame tagging",
    "note": "This section explains how to pass traffic for multiple VLANs between switches. It introduces the IEEE 802.1Q trunking protocol, which adds a VLAN tag to Ethernet frames. The configuration of trunk ports on Cisco switches is demonstrated."
  },
  {
    "n": 10,
    "title": "EtherChannel (LACP and PAgP)",
    "math": "Link aggregation",
    "note": "This lesson covers EtherChannel, a technology for bundling multiple physical switch ports into a single logical link to increase bandwidth and provide redundancy. It explains the two negotiation protocols used: LACP (Link Aggregation Control Protocol, open standard) and PAgP (Port Aggregation Protocol, Cisco proprietary)."
  },
  {
    "n": 11,
    "title": "Wireless LAN (WLAN) Concepts",
    "math": "Radio frequency (RF) principles",
    "note": "This section introduces the fundamentals of wireless networking. It covers the roles of Access Points (APs) and Wireless LAN Controllers (WLCs). Key concepts like SSIDs (Service Set Identifiers), RF channels, and the basic principles of Wi-Fi communication are explained."
  },
  {
    "n": 12,
    "title": "Routing Table Fundamentals",
    "math": "Graph traversal algorithms",
    "note": "This lesson explains how a router makes forwarding decisions based on its routing table. It covers how to read a routing table, including the meaning of route source codes, administrative distance (trustworthiness of the route source), and the metric (cost of the route)."
  },
  {
    "n": 13,
    "title": "Static Routing",
    "math": "Manual route configuration",
    "note": "This section covers how to manually configure routes on a router. It demonstrates the configuration of both IPv4 and IPv6 static routes, including default routes (the 'gateway of last resort'). The use cases and limitations of static routing are discussed."
  },
  {
    "n": 14,
    "title": "Introduction to OSPFv2",
    "math": "Shortest path first algorithms (Dijkstra)",
    "note": "This lesson introduces OSPF (Open Shortest Path First) as a dynamic routing protocol. It explains the concepts of neighbor adjacencies, router IDs, and areas. It also covers the OSPF cost metric calculation (based on bandwidth) and how it is used to find the shortest path to a destination."
  },
  {
    "n": 15,
    "title": "Configuring Single-Area OSPFv2",
    "math": "Network configuration",
    "note": "This lesson provides a practical guide to configuring and verifying single-area OSPFv2 in a lab environment. It covers the necessary commands to enable OSPF, configure network statements, and verify neighbor relationships and routing table entries using `show` commands."
  },
  {
    "n": 16,
    "title": "Network Address Translation (NAT)",
    "math": "Address mapping",
    "note": "This section explains the purpose and function of NAT for translating private IPv4 addresses to public IPv4 addresses. It covers the different types of NAT: static NAT (one-to-one mapping), dynamic NAT (many-to-many), and Port Address Translation (PAT) (many-to-one), which is the most common type."
  },
  {
    "n": 17,
    "title": "Network Time Protocol (NTP)",
    "math": "Time synchronization",
    "note": "This lesson covers NTP, a protocol used to synchronize the clocks of computer systems over a network. It explains the importance of accurate time for logging and security purposes and demonstrates how to configure a Cisco device to act as an NTP client."
  },
  {
    "n": 18,
    "title": "Dynamic Host Configuration Protocol (DHCP)",
    "math": "IP address leasing",
    "note": "This section explains how DHCP is used to automatically assign IP addresses and other network configuration information to clients. It covers the DHCP process (Discover, Offer, Request, Acknowledge - DORA) and demonstrates how to configure a Cisco router to act as a DHCP server."
  },
  {
    "n": 19,
    "title": "Domain Name System (DNS) and SNMP",
    "math": "Hierarchical naming systems, Management Information Base (MIB)",
    "note": "This lesson covers two critical IP services. It explains the role of DNS in translating human-readable domain names into IP addresses. It also provides an overview of SNMP (Simple Network Management Protocol) for collecting and organizing information about managed devices on IP networks."
  },
  {
    "n": 20,
    "title": "Access Control Lists (ACLs)",
    "math": "Set theory, Boolean logic",
    "note": "This lesson introduces ACLs as a tool for filtering traffic. It explains the difference between standard ACLs (which filter based on source IP) and extended ACLs (which filter based on source/destination IP, protocol, and port). The concept of an implicit 'deny any' at the end of an ACL is emphasized."
  },
  {
    "n": 21,
    "title": "Layer 2 Security Features",
    "math": "Access control",
    "note": "This section covers security features implemented on switches to protect the network at Layer 2. It explains DHCP Snooping to prevent rogue DHCP servers, Dynamic ARP Inspection to prevent ARP spoofing, and Port Security to limit the number of MAC addresses allowed on a port."
  },
  {
    "n": 22,
    "title": "Wireless LAN Security Protocols",
    "math": "Encryption standards",
    "note": "This lesson focuses on securing wireless networks. It covers the different security protocols available, including WPA2 and the modern WPA3 standard. The configuration of Pre-Shared Key (PSK) authentication for a SOHO environment is demonstrated."
  },
  {
    "n": 23,
    "title": "Introduction to Network Automation",
    "math": "API principles",
    "note": "This section introduces the modern shift towards network automation and programmability. It explains how automation can improve efficiency and reduce errors. The lesson contrasts traditional manual configuration with modern approaches using APIs and configuration management tools."
  },
  {
    "n": 24,
    "title": "REST APIs and JSON",
    "math": "RESTful architecture, JSON data structures",
    "note": "This lesson provides an overview of REST APIs as a common way for applications to communicate over HTTP. It explains the basic principles of REST. It also introduces JSON (JavaScript Object Notation) as a lightweight, human-readable data format used for data exchange in modern APIs."
  },
  {
    "n": 25,
    "title": "Configuration Management Tools",
    "math": "Declarative configuration",
    "note": "This final lesson provides a high-level overview of popular configuration management tools like Ansible, Puppet, and Chef. It explains how these tools allow network administrators to define the desired state of their network devices in code, and the tool then automatically enforces that state."
  }
]
