[
  {
    "n": 1,
    "title": "Module 1: Networking Today - What is a Network?",
    "math": "N/A",
    "note": "Introduce the concept of a network, its purpose, and the different types of networks (LAN, WAN, SOHO)."
  },
  {
    "n": 2,
    "title": "Role of Routers and Switches",
    "math": "N/A",
    "note": "Explain the fundamental roles of routers (forwarding packets between different networks, Layer 3) and switches (forwarding frames within a single network, Layer 2)."
  },
  {
    "n": 3,
    "title": "Next-Generation Firewalls and Access Points",
    "math": "N/A",
    "note": "Introduce other key network components: Next-Generation Firewalls (NGFW) for security and Access Points (APs) for wireless connectivity."
  },
  {
    "n": 4,
    "title": "Two-Tier and Three-Tier Architectures",
    "math": "Graph Theory",
    "note": "Compare and contrast the traditional three-tier (core, distribution, access) and two-tier (collapsed core) hierarchical network design models."
  },
  {
    "n": 5,
    "title": "Spine-Leaf Architecture",
    "math": "N/A",
    "note": "Introduce the modern spine-leaf architecture used in data centers, explaining its advantages for scalability and low latency."
  },
  {
    "n": 6,
    "title": "Cabling: Copper (Cat5e, Cat6)",
    "math": "N/A",
    "note": "Cover twisted-pair copper cabling standards. Explain the differences between Cat 5e and Cat 6, and concepts like straight-through vs. crossover cables."
  },
  {
    "n": 7,
    "title": "Cabling: Fiber Optic",
    "math": "N/A",
    "note": "Explain fiber optic cabling. Differentiate between single-mode (long distance) and multi-mode (shorter distance) fiber."
  },
  {
    "n": 8,
    "title": "Troubleshooting Physical Layer Issues",
    "math": "N/A",
    "note": "Discuss how to identify and troubleshoot common physical layer issues, such as duplex mismatches, collisions, and speed negotiation problems."
  },
  {
    "n": 9,
    "title": "Module 2: TCP/IP - The TCP/IP Model",
    "math": "N/A",
    "note": "Introduce the four-layer TCP/IP model (Application, Transport, Internet, Network Access) and compare it to the seven-layer OSI model."
  },
  {
    "n": 10,
    "title": "TCP vs. UDP",
    "math": "N/A",
    "note": "Compare TCP (connection-oriented, reliable) and UDP (connectionless, best-effort). Explain the TCP three-way handshake."
  },
  {
    "n": 11,
    "title": "Binary Numbering",
    "math": "Base Conversion",
    "note": "Teach how to convert decimal numbers to binary and back, a foundational skill for IP addressing."
  },
  {
    "n": 12,
    "title": "Hexadecimal Numbering",
    "math": "Base Conversion",
    "note": "Teach how to convert between binary, hexadecimal, and decimal, focusing on its use in IPv6 and MAC addresses."
  },
  {
    "n": 13,
    "title": "IPv4 Address Structure",
    "math": "N/A",
    "note": "Break down the 32-bit IPv4 address into its network and host portions. Explain the concept of the subnet mask."
  },
  {
    "n": 14,
    "title": "IPv4 Address Classes and Private Ranges",
    "math": "N/A",
    "note": "Explain the historical IP address classes (A, B, C) and define the private IP address ranges specified in RFC 1918."
  },
  {
    "n": 15,
    "title": "IPv4 Subnetting",
    "math": "Boolean Algebra",
    "note": "Provide a step-by-step guide to subnetting an IPv4 network to create smaller, more manageable subnets."
  },
  {
    "n": 16,
    "title": "Variable Length Subnet Masking (VLSM)",
    "math": "N/A",
    "note": "Introduce VLSM as a technique to use different subnet masks for different subnets, which conserves IP address space."
  },
  {
    "n": 17,
    "title": "IPv6 Address Structure and Types",
    "math": "N/A",
    "note": "Explain the 128-bit IPv6 address format, hexadecimal notation, and abbreviation rules. Cover address types like global unicast, unique local, and link-local."
  },
  {
    "n": 18,
    "title": "IPv6 Address Configuration (SLAAC and DHCPv6)",
    "math": "N/A",
    "note": "Explain the two main methods for IPv6 address autoconfiguration: SLAAC (Stateless Address Autoconfiguration) and stateful DHCPv6."
  },
  {
    "n": 19,
    "title": "Module 3: Switching - MAC Addresses",
    "math": "N/A",
    "note": "Explain the structure and purpose of a MAC address. Describe how switches use MAC addresses to forward frames at Layer 2."
  },
  {
    "n": 20,
    "title": "The MAC Address Table",
    "math": "N/A",
    "note": "Explain how a switch builds its MAC address table by learning the source MAC addresses of frames that enter its ports."
  },
  {
    "n": 21,
    "title": "Introduction to VLANs",
    "math": "Set Theory",
    "note": "Introduce Virtual LANs (VLANs) as a mechanism to logically segment a physical network into separate broadcast domains."
  },
  {
    "n": 22,
    "title": "Configuring VLANs and Access Ports",
    "math": "N/A",
    "note": "Demonstrate how to create VLANs on a Cisco switch and assign switch ports to a specific VLAN as access ports."
  },
  {
    "n": 23,
    "title": "VLAN Trunking with 802.1Q",
    "math": "N/A",
    "note": "Explain the IEEE 802.1Q trunking protocol for passing traffic for multiple VLANs between switches. Demonstrate trunk port configuration."
  },
  {
    "n": 24,
    "title": "Dynamic Trunking Protocol (DTP)",
    "math": "N/A",
    "note": "Introduce DTP as a Cisco-proprietary protocol for automatically negotiating trunk links. Discuss its different modes."
  },
  {
    "n": 25,
    "title": "EtherChannel (LACP and PAgP)",
    "math": "N/A",
    "note": "Cover EtherChannel for bundling multiple physical links into a single logical link. Explain the LACP (open standard) and PAgP (Cisco proprietary) negotiation protocols."
  },
  {
    "n": 26,
    "title": "Spanning Tree Protocol (STP)",
    "math": "Graph Theory",
    "note": "Introduce STP (802.1D) as a protocol that prevents Layer 2 loops in networks with redundant switch links. Explain the election of a root bridge and port roles."
  },
  {
    "n": 27,
    "title": "Module 4: Routing - The Routing Table",
    "math": "N/A",
    "note": "Explain how a router makes forwarding decisions. Cover how to read a routing table, including route source, administrative distance, and metric."
  },
  {
    "n": 28,
    "title": "Static Routing",
    "math": "N/A",
    "note": "Demonstrate the configuration of IPv4 and IPv6 static routes, including default routes ('gateway of last resort')."
  },
  {
    "n": 29,
    "title": "Inter-VLAN Routing",
    "math": "N/A",
    "note": "Explain the need for a router or Layer 3 switch to enable communication between different VLANs. Introduce the 'Router on a Stick' configuration."
  },
  {
    "n": 30,
    "title": "Introduction to OSPFv2",
    "math": "Shortest Path First Algorithms",
    "note": "Introduce OSPF as a dynamic routing protocol. Explain neighbor adjacencies, router IDs, areas, and the cost metric."
  },
  {
    "n": 31,
    "title": "Configuring Single-Area OSPFv2",
    "math": "N/A",
    "note": "Provide a practical guide to configuring and verifying single-area OSPFv2, including network statements and `show` commands."
  },
  {
    "n": 32,
    "title": "Module 5: IP Services - Network Address Translation (NAT)",
    "math": "N/A",
    "note": "Explain the purpose of NAT. Differentiate between static NAT, dynamic NAT, and Port Address Translation (PAT)."
  },
  {
    "n": 33,
    "title": "Network Time Protocol (NTP)",
    "math": "N/A",
    "note": "Cover NTP for synchronizing clocks. Demonstrate how to configure a Cisco device as an NTP client."
  },
  {
    "n": 34,
    "title": "Dynamic Host Configuration Protocol (DHCP)",
    "math": "N/A",
    "note": "Explain the DORA process. Demonstrate how to configure a Cisco router to act as a DHCP server."
  },
  {
    "n": 35,
    "title": "Domain Name System (DNS)",
    "math": "N/A",
    "note": "Explain the role of DNS in translating domain names to IP addresses. Cover how to configure DNS servers on a client device."
  },
  {
    "n": 36,
    "title": "Simple Network Management Protocol (SNMP)",
    "math": "N/A",
    "note": "Provide an overview of SNMP for collecting information about managed devices on a network."
  },
  {
    "n": 37,
    "title": "Module 6: Security - Access Control Lists (ACLs)",
    "math": "Boolean Logic",
    "note": "Introduce ACLs for filtering traffic. Explain the difference between standard and extended ACLs and the implicit 'deny any'."
  },
  {
    "n": 38,
    "title": "Configuring Standard and Extended ACLs",
    "math": "N/A",
    "note": "Demonstrate how to configure numbered and named ACLs and apply them to router interfaces."
  },
  {
    "n": 39,
    "title": "Port Security",
    "math": "N/A",
    "note": "Teach how to configure Port Security on a Cisco switch to limit the number of MAC addresses allowed on a port and prevent MAC address flooding."
  },
  {
    "n": 40,
    "title": "DHCP Snooping",
    "math": "N/A",
    "note": "Explain how DHCP Snooping is used to prevent rogue DHCP servers from operating on the network."
  },
  {
    "n": 41,
    "title": "Wireless LAN Security (WPA2/WPA3)",
    "math": "N/A",
    "note": "Cover securing wireless networks with WPA2 and WPA3. Demonstrate configuring Pre-Shared Key (PSK) authentication."
  },
  {
    "n": 42,
    "title": "Module 7: Automation - REST APIs and JSON",
    "math": "N/A",
    "note": "Provide an overview of REST APIs and JSON as foundational technologies for modern network automation."
  },
  {
    "n": 43,
    "title": "Configuration Management Tools",
    "math": "N/A",
    "note": "Provide a high-level overview of Ansible, Puppet, and Chef and their role in declarative network configuration."
  },
  {
    "n": 44,
    "title": "Module 8: Final Project - Small Office Network",
    "math": "N/A",
    "note": "Outline the final project: design and configure a small office network in Cisco Packet Tracer, including a router, two switches, two VLANs, and basic security."
  },
  {
    "n": 45,
    "title": "Final Project: Network Design and IP Addressing",
    "math": "N/A",
    "note": "Create a network diagram and an IP addressing scheme for the final project network."
  },
  {
    "n": 46,
    "title": "Final Project: Basic Device Configuration",
    "math": "N/A",
    "note": "Perform initial device configuration, including hostnames, passwords, and management IP addresses."
  },
  {
    "n": 47,
    "title": "Final Project: VLANs and Trunking",
    "math": "N/A",
    "note": "Configure two VLANs (e.g., Sales and Engineering) and set up an 802.1Q trunk between the two switches."
  },
  {
    "n": 48,
    "title": "Final Project: Inter-VLAN Routing",
    "math": "N/A",
    "note": "Configure 'Router on a Stick' on the router to enable communication between the two VLANs."
  },
  {
    "n": 49,
    "title": "Final Project: Security Configuration",
    "math": "N/A",
    "note": "Implement a basic ACL to restrict traffic between the VLANs and configure Port Security on the switches."
  },
  {
    "n": 50,
    "title": "Module 9: Further Reading",
    "math": "N/A",
    "note": "Provide links to the official Cisco CCNA exam topics, recommended study guides, and online lab resources."
  }
]
