[
  {
    "n": 1,
    "title": "Module 1: Enterprise Architecture - Hierarchical Design",
    "math": "N/A",
    "note": "Review the two-tier (collapsed core) and three-tier (core, distribution, access) hierarchical network design models. Discuss scalability, redundancy, and performance implications of each. The context is the CCNP ENCOR exam blueprint."
  },
  {
    "n": 2,
    "title": "Spine-Leaf Architecture",
    "math": "Graph Theory",
    "note": "Deep dive into the spine-leaf architecture for modern data centers. Explain how it provides high bandwidth, low latency, and predictable performance for east-west traffic flows."
  },
  {
    "n": 3,
    "title": "SD-WAN and SD-Access",
    "math": "N/A",
    "note": "Introduce Cisco's Software-Defined Networking (SDN) solutions. Explain the concepts of SD-WAN for intelligent wide-area networking and SD-Access for policy-based automation in campus networks."
  },
  {
    "n": 4,
    "title": "Module 2: Advanced Switching - STP Deep Dive",
    "math": "Graph Algorithms",
    "note": "Go beyond basic STP. Cover the mechanics of RSTP (802.1w) for faster convergence and MSTP (802.1s) for load balancing across multiple VLANs."
  },
  {
    "n": 5,
    "title": "STP Security and Optimization",
    "math": "N/A",
    "note": "Teach how to secure the STP topology using features like BPDU Guard, Root Guard, and Loop Guard. Discuss optimization techniques."
  },
  {
    "n": 6,
    "title": "VTP and DTP",
    "math": "N/A",
    "note": "Cover VLAN Trunking Protocol (VTP) for centralized VLAN management and Dynamic Trunking Protocol (DTP) for trunk negotiation. Discuss best practices and security risks."
  },
  {
    "n": 7,
    "title": "EtherChannel Configuration",
    "math": "N/A",
    "note": "Provide a detailed guide to configuring link aggregation with EtherChannel, covering both LACP and PAgP negotiation protocols and load-balancing algorithms."
  },
  {
    "n": 8,
    "title": "First Hop Redundancy Protocols (FHRP)",
    "math": "N/A",
    "note": "Detail the configuration and operation of HSRP, VRRP, and GLBP for providing default gateway redundancy."
  },
  {
    "n": 9,
    "title": "Module 3: Advanced Routing - EIGRP",
    "math": "Finite State Machines",
    "note": "Deep dive into EIGRP's DUAL algorithm. Explain Feasible Distance, Reported Distance, and the concepts of successor and feasible successor."
  },
  {
    "n": 10,
    "title": "EIGRP Optimization",
    "math": "N/A",
    "note": "Cover manual route summarization, unequal-cost load balancing with `variance`, and stub routing."
  },
  {
    "n": 11,
    "title": "OSPF: LSA Types",
    "math": "N/A",
    "note": "Provide a detailed breakdown of the common OSPF LSA types (1, 2, 3, 4, 5, 7) and the information they carry."
  },
  {
    "n": 12,
    "title": "OSPF: Area Types",
    "math": "N/A",
    "note": "Explain OSPF area types: backbone, standard, stub, totally stubby, and Not-So-Stubby-Areas (NSSA)."
  },
  {
    "n": 13,
    "title": "OSPF: Multi-Area Configuration",
    "math": "N/A",
    "note": "Demonstrate how to configure a multi-area OSPF network, including summarization between areas."
  },
  {
    "n": 14,
    "title": "Route Redistribution",
    "math": "N/A",
    "note": "Explain how to configure route redistribution between different routing protocols. Discuss seed metrics and administrative distance manipulation."
  },
  {
    "n": 15,
    "title": "Controlling Redistribution with Route Maps",
    "math": "Policy-Based Routing",
    "note": "Introduce route maps to filter routes and modify their attributes during redistribution using `match` and `set` commands."
  },
  {
    "n": 16,
    "title": "Introduction to BGP",
    "math": "N/A",
    "note": "Introduce BGP as the routing protocol of the internet. Explain Autonomous Systems (AS), eBGP vs. iBGP, and the concept of path attributes."
  },
  {
    "n": 17,
    "title": "BGP Path Selection Algorithm",
    "math": "N/A",
    "note": "Detail the BGP best-path selection algorithm, covering Weight, Local Preference, AS_PATH, Origin, and MED."
  },
  {
    "n": 18,
    "title": "Configuring BGP",
    "math": "N/A",
    "note": "Demonstrate how to configure eBGP and iBGP peerings and advertise networks into BGP."
  },
  {
    "n": 19,
    "title": "Module 4: VPN Technologies - VRF-Lite",
    "math": "N/A",
    "note": "Introduce VRF (Virtual Routing and Forwarding) to create multiple virtual routers within a single physical router for network segmentation."
  },
  {
    "n": 20,
    "title": "GRE Tunneling",
    "math": "Encapsulation",
    "note": "Cover Generic Routing Encapsulation (GRE) for creating simple, unencrypted tunnels over an IP network."
  },
  {
    "n": 21,
    "title": "DMVPN",
    "math": "N/A",
    "note": "Introduce Dynamic Multipoint VPN (DMVPN) as a scalable VPN solution using mGRE, NHRP, and IPsec."
  },
  {
    "n": 22,
    "title": "IPsec Fundamentals",
    "math": "Cryptography",
    "note": "Explain the IPsec framework, including the roles of IKE, ESP, and AH for creating secure VPN tunnels."
  },
  {
    "n": 23,
    "title": "Module 5: Infrastructure Security - AAA",
    "math": "N/A",
    "note": "Cover securing device management using the AAA framework with local authentication and centralized RADIUS/TACACS+."
  },
  {
    "n": 24,
    "title": "Control Plane Policing (CoPP)",
    "math": "N/A",
    "note": "Introduce CoPP to protect the router's CPU from denial-of-service attacks by rate-limiting traffic."
  },
  {
    "n": 25,
    "title": "Module 6: Network Assurance - Syslog and SNMP",
    "math": "N/A",
    "note": "Cover configuring devices to send logs to a Syslog server and using SNMP to poll devices for performance data."
  },
  {
    "n": 26,
    "title": "NetFlow",
    "math": "Data Flow Analysis",
    "note": "Introduce NetFlow for collecting and analyzing IP traffic information for monitoring and security analysis."
  },
  {
    "n": 27,
    "title": "SPAN/RSPAN",
    "math": "N/A",
    "note": "Cover Switched Port Analyzer (SPAN) and Remote SPAN (RSPAN) for mirroring traffic to a network analyzer."
  },
  {
    "n": 28,
    "title": "Module 7: Wireless - Advanced WLANs",
    "math": "N/A",
    "note": "Cover advanced wireless concepts such as RF design, roaming, and configuring multiple SSIDs on a Wireless LAN Controller (WLC)."
  },
  {
    "n": 29,
    "title": "Wireless Security",
    "math": "N/A",
    "note": "Deep dive into securing wireless networks with WPA2/WPA3 and Enterprise authentication using 802.1X and a RADIUS server."
  },
  {
    "n": 30,
    "title": "Module 8: Automation - Data Formats",
    "math": "N/A",
    "note": "Cover the data formats used in network automation: JSON for data exchange and YANG as a data modeling language."
  },
  {
    "n": 31,
    "title": "APIs: REST and NETCONF/RESTCONF",
    "math": "N/A",
    "note": "Introduce the primary protocols for programmatic device interaction: REST APIs and the standardized NETCONF and RESTCONF protocols."
  },
  {
    "n": 32,
    "title": "Configuration Management Tools",
    "math": "N/A",
    "note": "Provide an overview of Ansible, Puppet, and Chef for automating network infrastructure deployment and management."
  },
  {
    "n": 33,
    "title": "Module 9: Final Project - Enterprise Network",
    "math": "N/A",
    "note": "Outline the final project: design and configure a multi-site enterprise network with redundant links, multiple routing protocols (EIGRP, OSPF, BGP), and advanced services in a simulator."
  },
  {
    "n": 34,
    "title": "Final Project: Designing the Topology",
    "math": "N/A",
    "note": "Create a detailed network diagram and IP addressing plan for a headquarters site and two branch offices."
  },
  {
    "n": 35,
    "title": "Final Project: IGP Configuration",
    "math": "N/A",
    "note": "Configure EIGRP and OSPF as the Interior Gateway Protocols within the different sites."
  },
  {
    "n": 36,
    "title": "Final Project: BGP Configuration and Redistribution",
    "math": "N/A",
    "note": "Configure eBGP between the sites and redistribute the IGP routes into BGP, using route maps to control the process."
  },
  {
    "n": 37,
    "title": "Module 10: Further Reading",
    "math": "N/A",
    "note": "Provide links to official Cisco documentation, white papers, and study resources for the CCNP concentration exams like ENARSI."
  }
]
