[
  {
    "n": 1,
    "title": "Introduction to Excel",
    "math": "Matrix algebra",
    "note": "This section introduces Microsoft Excel as a powerful spreadsheet application. It covers the basic interface: the ribbon, worksheets, rows, columns, and cells. The context is the modern desktop version of Excel."
  },
  {
    "n": 2,
    "title": "Data Entry and Formatting",
    "math": "Data entry",
    "note": "Covers how to enter text, numbers, and dates into cells. The lesson also introduces basic cell formatting, including font styles, alignment, cell borders, and number formats (e.g., Currency, Percentage)."
  },
  {
    "n": 3,
    "title": "Introduction to Formulas and Cell References",
    "math": "Arithmetic, coordinate geometry",
    "note": "Introduces formulas using arithmetic operators (`+`, `-`, `*`, `/`). It also explains the critical difference between relative (`A1`), absolute (`$A$1`), and mixed (`A$1` or `$A1`) cell references."
  },
  {
    "n": 4,
    "title": "Basic Functions: SUM, AVERAGE, COUNT, MAX, MIN",
    "math": "Statistics",
    "note": "Introduces some of the most common built-in functions in Excel: `SUM` for adding numbers, `AVERAGE` for finding the mean, `COUNT` for counting cells with numbers, and `MAX`/`MIN` for finding the largest/smallest value."
  },
  {
    "n": 5,
    "title": "Managing Worksheets and Workbooks",
    "math": "Set theory",
    "note": "Covers how to manage worksheets (renaming, adding, deleting, moving, copying) and workbook-level features like freezing panes to keep headers visible while scrolling through large datasets."
  },
  {
    "n": 6,
    "title": "Sorting and Filtering Data",
    "math": "Sorting and filtering",
    "note": "Explains how to sort data based on one or more columns and how to use AutoFilter to quickly display only the data that meets specific criteria."
  },
  {
    "n": 7,
    "title": "Working with Excel Tables",
    "math": "Structured data",
    "note": "Explains the benefits of formatting a data range as an Excel Table. The lesson covers creating tables, using table styles, and how tables automatically expand and provide features like built-in filtering and total rows."
  },
  {
    "n": 8,
    "title": "Structured References in Tables",
    "math": "Algebra",
    "note": "Demonstrates how to use structured references (e.g., `TableName[ColumnName]`) when working with Excel Tables. This makes formulas more readable and resilient to changes in the table structure."
  },
  {
    "n": 9,
    "title": "Introduction to Charts",
    "math": "Data visualization",
    "note": "This lesson covers how to create basic charts to visualize data. It explains how to select data for a chart and how to create and format common chart types like column, line, and pie charts."
  },
  {
    "n": 10,
    "title": "Conditional Formatting",
    "math": "Logic",
    "note": "This lesson covers how to use conditional formatting to automatically change the appearance of cells based on their values. It demonstrates data bars, color scales, icon sets, and rule-based formatting."
  },
  {
    "n": 11,
    "title": "Logical Functions: IF, AND, OR",
    "math": "Boolean algebra",
    "note": "Introduces the powerful `IF` function for performing a logical test. It also explains how to use the `AND` and `OR` functions, often within an `IF` function, to test multiple logical conditions at once."
  },
  {
    "n": 12,
    "title": "Lookup Functions: VLOOKUP and XLOOKUP",
    "math": "Search algorithms",
    "note": "This section explains how to find and retrieve data from a table. It covers the classic `VLOOKUP` function and introduces the modern and more flexible `XLOOKUP` function as the recommended best practice."
  },
  {
    "n": 13,
    "title": "Text Functions",
    "math": "String manipulation",
    "note": "This lesson covers a range of functions for manipulating text, such as `CONCAT` (and the `&` operator), `LEFT`, `RIGHT`, `TRIM`, and `FIND`. It demonstrates how to clean and reformat text data."
  },
  {
    "n": 14,
    "title": "Date and Time Functions",
    "math": "Time series analysis",
    "note": "Explains how to work with dates and times in Excel. The lesson covers functions like `TODAY`, `NOW`, `DATE`, `YEAR`, and `DATEDIF` for performing calculations with date and time values."
  },
  {
    "n": 15,
    "title": "Data Validation",
    "math": "Data integrity",
    "note": "Explains how to use data validation to restrict the type of data or the values that users can enter into a cell. The lesson covers creating dropdown lists from a range and setting custom validation rules."
  },
  {
    "n": 16,
    "title": "Introduction to PivotTables",
    "math": "Data aggregation",
    "note": "Provides an introduction to PivotTables, one of Excel's most powerful features for summarizing, analyzing, and exploring large datasets. The lesson covers creating a basic PivotTable and arranging fields in the PivotTable Fields pane."
  },
  {
    "n": 17,
    "title": "Analyzing Data with PivotTables",
    "math": "Data summarization",
    "note": "Dives deeper into PivotTables by explaining how to sort, filter, and group data. The lesson also covers changing the summary calculation (e.g., from SUM to AVERAGE) and showing values as a percentage of the total."
  },
  {
    "n": 18,
    "title": "Slicers, Timelines, and PivotCharts",
    "math": "Interactive data visualization",
    "note": "Introduces slicers and timelines as interactive controls for filtering PivotTables. It also explains how to create a PivotChart, which is a chart that is linked to a PivotTable, to create dynamic dashboards."
  },
  {
    "n": 19,
    "title": "What-If Analysis: Goal Seek and Scenarios",
    "math": "Optimization",
    "note": "Introduces Excel's What-If Analysis tools. This lesson covers Goal Seek for finding the required input for a desired result, and Scenario Manager for comparing the outcomes of different sets of assumptions."
  },
  {
    "n": 20,
    "title": "Advanced What-If: The Solver Add-in",
    "math": "Linear programming",
    "note": "This lesson introduces the Solver Add-in as a more powerful optimization tool. It explains how Solver can be used to find an optimal value for a formula by changing multiple input cells, subject to a set of constraints."
  },
  {
    "n": 21,
    "title": "Dynamic Array Formulas",
    "math": "Array formulas",
    "note": "A dedicated lesson on the modern dynamic array engine in Microsoft 365. It explains how formulas can now 'spill' results into multiple cells and introduces key functions like `FILTER`, `SORT`, `UNIQUE`, and `SEQUENCE`."
  },
  {
    "n": 22,
    "title": "Introduction to Power Query",
    "math": "Data transformation (ETL)",
    "note": "Provides an introduction to Power Query (Get & Transform Data) for importing, connecting, and transforming data from various sources. The lesson shows how to perform basic cleaning and shaping operations before loading data into Excel."
  },
  {
    "n": 23,
    "title": "The Data Model and Power Pivot",
    "math": "Relational modeling",
    "note": "This lesson explains how to go beyond single-table analysis by using Excel's Data Model. It introduces Power Pivot as the tool to create relationships between multiple tables, forming a relational model directly within Excel."
  },
  {
    "n": 24,
    "title": "Introduction to DAX",
    "math": "Data Analysis Expressions (DAX)",
    "note": "This lesson introduces DAX as the formula language for Power Pivot. It explains the difference between a calculated column and a measure (a key DAX concept) and demonstrates a few simple DAX formulas like `SUMX` and `CALCULATE`."
  },
  {
    "n": 25,
    "title": "Introduction to Macros and VBA",
    "math": "Automation",
    "note": "This lesson introduces macros for automating repetitive tasks in Excel. It covers how to use the Macro Recorder to create a simple macro and provides a brief introduction to the Visual Basic for Applications (VBA) editor."
  }
]
