[
  {
    "n": 1,
    "title": "Introduction to Law and Ethics in Information Security",
    "math": "Legal and ethical frameworks",
    "note": "This section defines the scope of the course, explaining the critical intersection of law, ethics, and information security. It differentiates between laws (which are enforceable by government), regulations (mandated rules for compliance), and ethics (moral principles that govern behavior)."
  },
  {
    "n": 2,
    "title": "Intellectual Property: Copyright",
    "math": "Copyright law",
    "note": "This lesson introduces Intellectual Property (IP) and focuses on Copyright law. It explains that copyright protects original works of authorship, such as software code, literature, and music. The concept of 'fair use' and the protections afforded to copyright holders are discussed."
  },
  {
    "n": 3,
    "title": "Intellectual Property: The Digital Millennium Copyright Act (DMCA)",
    "math": "Digital rights management (DRM)",
    "note": "This section covers the DMCA, a significant U.S. copyright law. It explains its two main components: the anti-circumvention provisions, which make it illegal to bypass technologies that control access to copyrighted works (DRM), and the 'safe harbor' provisions, which protect online service providers from liability for user-infringed content."
  },
  {
    "n": 4,
    "title": "Intellectual Property: Patents, Trademarks, and Trade Secrets",
    "math": "Patent and trademark law",
    "note": "This lesson covers other major forms of IP. It explains Patents (which protect inventions), Trademarks (which protect brand identity like logos and names), and Trade Secrets (confidential business information that provides a competitive edge). The differences in protection and requirements for each are detailed."
  },
  {
    "n": 5,
    "title": "Software Licensing",
    "math": "Licensing agreements",
    "note": "This section explains how software is legally distributed. It contrasts proprietary licenses (which are restrictive) with open-source licenses. It provides an overview of common open-source license types, such as permissive licenses (like MIT and Apache) and copyleft licenses (like the GPL)."
  },
  {
    "n": 6,
    "title": "What Is Cybercrime?",
    "math": "Criminal law",
    "note": "This lesson defines cybercrime as a crime that involves a computer and a network. It categorizes cybercrime into two main types: crimes where the computer is the target (e.g., hacking, malware deployment) and crimes where the computer is used as a tool to commit an offense (e.g., fraud, identity theft)."
  },
  {
    "n": 7,
    "title": "Key U.S. Cybercrime Law: The Computer Fraud and Abuse Act (CFAA)",
    "math": "Computer crime legislation",
    "note": "This section focuses on the CFAA, the primary anti-hacking law in the United States. It explains what the law prohibits, such as intentionally accessing a computer without authorization or exceeding authorized access. The controversy surrounding its broad interpretation is also discussed."
  },
  {
    "n": 8,
    "title": "International Cooperation: The Budapest Convention",
    "math": "International treaties",
    "note": "This lesson introduces the Budapest Convention on Cybercrime, the first international treaty seeking to address Internet and computer crime by harmonizing national laws, improving investigative techniques, and increasing cooperation among nations."
  },
  {
    "n": 9,
    "title": "The Right to Privacy",
    "math": "Privacy law",
    "note": "This section introduces the concept of privacy as a fundamental right. It discusses the different dimensions of privacy (e.g., privacy of person, privacy of communication) and the legal challenges of protecting privacy in the digital age, where vast amounts of personal data are collected and processed."
  },
  {
    "n": 10,
    "title": "European Union: The General Data Protection Regulation (GDPR)",
    "math": "Data protection regulation (GDPR)",
    "note": "This lesson provides a detailed overview of the GDPR, a landmark regulation that has set a global standard for data protection. It covers its wide scope, key definitions (like 'personal data' and 'processing'), and its core principles, such as data minimization and purpose limitation."
  },
  {
    "n": 11,
    "title": "GDPR: Rights of the Data Subject",
    "math": "Individual rights",
    "note": "This section focuses on the rights that GDPR grants to individuals. These include the right to access their data, the right to correct inaccuracies (rectification), the right to be forgotten (erasure), and the right to data portability. The role of the Data Protection Officer (DPO) is also explained."
  },
  {
    "n": 12,
    "title": "U.S. Privacy Law: CCPA and HIPAA",
    "math": "Sector-specific privacy laws",
    "note": "This lesson covers major privacy laws in the United States. It explains the California Consumer Privacy Act (CCPA), which grants California consumers new rights over their personal information. It also covers the Health Insurance Portability and Accountability Act (HIPAA), which provides data privacy and security provisions for safeguarding medical information."
  },
  {
    "n": 13,
    "title": "Compliance Frameworks: NIST and ISO 27001",
    "math": "Information security standards",
    "note": "This section introduces the concept of a compliance framework as a structured set of guidelines and best practices. It provides an overview of the NIST Cybersecurity Framework and the ISO/IEC 27001 standard for information security management systems (ISMS), which help organizations manage and improve their security posture."
  },
  {
    "n": 14,
    "title": "The Payment Card Industry Data Security Standard (PCI DSS)",
    "math": "Financial regulation",
    "note": "This lesson covers PCI DSS, a set of security standards designed to ensure that all companies that accept, process, store, or transmit credit card information maintain a secure environment. It is not a law, but a contractual requirement for any organization handling major credit cards."
  },
  {
    "n": 15,
    "title": "Corporate Security Policies",
    "math": "Corporate governance",
    "note": "This section explains the importance of having formal, written information security policies within an organization. It covers the purpose of a high-level Information Security Policy and more specific policies like the Acceptable Use Policy (AUP), which defines how employees are permitted to use company IT assets."
  },
  {
    "n": 16,
    "title": "Incident Response Planning",
    "math": "Incident response",
    "note": "This lesson emphasizes the legal and business need for a formal Incident Response Plan (IRP). An IRP is a documented set of instructions to help IT staff detect, respond to, and recover from network security incidents. It outlines procedures to minimize damage and recovery time."
  },
  {
    "n": 17,
    "title": "Professional Ethics in Security",
    "math": "Codes of ethics",
    "note": "This section discusses the ethical responsibilities of information security professionals. It covers professional codes of conduct, such as those from (ISC)², which require members to act honorably, honestly, justly, responsibly, and legally. The ethics of vulnerability disclosure and penetration testing are explored."
  },
  {
    "n": 18,
    "title": "Legal Issues in Cloud Computing",
    "math": "Data sovereignty",
    "note": "This lesson explores the legal complexities introduced by cloud computing. A key issue is data sovereignty, which refers to the concept that information which has been converted and stored in binary digital form is subject to the laws of the country in which it is located. This creates challenges for global cloud services."
  },
  {
    "n": 19,
    "title": "Legal Issues in the Internet of Things (IoT)",
    "math": "IoT law and regulation",
    "note": "This section discusses the unique legal challenges posed by the proliferation of IoT devices. It covers issues related to the privacy of data collected by smart devices, the security of those devices against hacking, and questions of liability when an IoT device fails or causes harm."
  },
  {
    "n": 20,
    "title": "The Future of Cyber Law",
    "math": "Emerging legal topics",
    "note": "This final lesson looks at future legal and ethical challenges. It touches on emerging topics like the legal personality and liability of AI systems, the regulation of cryptocurrencies, and the ongoing global debate between government surveillance and individual privacy."
  }
]
