[
  {
    "n": 1,
    "title": "Introduction to Law, Regulations, and Ethics",
    "math": "Legal and ethical frameworks",
    "note": "This section defines the scope of the course, explaining the critical intersection of law, ethics, and information security. It differentiates between laws (enforceable by government), regulations (mandated rules), and ethics (moral principles)."
  },
  {
    "n": 2,
    "title": "Intellectual Property: Copyright",
    "math": "Copyright law",
    "note": "This lesson introduces Intellectual Property (IP) and focuses on Copyright law. It explains that copyright protects original works of authorship, such as software code and literature. The concept of 'fair use' and the Digital Millennium Copyright Act (DMCA) are discussed."
  },
  {
    "n": 3,
    "title": "Intellectual Property: Patents, Trademarks, and Trade Secrets",
    "math": "Patent and trademark law",
    "note": "This lesson covers other major forms of IP. It explains Patents (which protect inventions), Trademarks (which protect brand identity like logos), and Trade Secrets (confidential business information). The differences in protection and requirements for each are detailed."
  },
  {
    "n": 4,
    "title": "Software Licensing",
    "math": "Licensing agreements",
    "note": "This section explains how software is legally distributed. It contrasts proprietary licenses with open-source licenses and provides an overview of common open-source license types, such as permissive (MIT, Apache) and copyleft (GPL)."
  },
  {
    "n": 5,
    "title": "Cybercrime",
    "math": "Criminal law",
    "note": "This lesson defines cybercrime as a crime that involves a computer and a network. It covers key US legislation like the Computer Fraud and Abuse Act (CFAA) and international efforts like the Budapest Convention on Cybercrime."
  },
  {
    "n": 6,
    "title": "The Right to Privacy",
    "math": "Privacy law",
    "note": "This section introduces the concept of privacy as a fundamental right and discusses the legal challenges of protecting privacy in the digital age, where vast amounts of personal data are collected and processed."
  },
  {
    "n": 7,
    "title": "Global Privacy Regulation: GDPR",
    "math": "Data protection regulation (GDPR)",
    "note": "This lesson provides a detailed overview of the EU's General Data Protection Regulation, a landmark regulation that has set a global standard. It covers its scope, key principles (like data minimization), and the rights it grants to data subjects (like the right to erasure)."
  },
  {
    "n": 8,
    "title": "U.S. Privacy Law: CCPA/CPRA",
    "math": "State-level privacy laws",
    "note": "This lesson covers major privacy laws in the United States, focusing on the California Consumer Privacy Act (CCPA) and its successor, the California Privacy Rights Act (CPRA), which grant California consumers new rights over their personal information."
  },
  {
    "n": 9,
    "title": "U.S. Sector-Specific Privacy: HIPAA",
    "math": "Healthcare privacy law",
    "note": "This lesson covers the Health Insurance Portability and Accountability Act (HIPAA), which provides data privacy and security provisions for safeguarding protected health information (PHI) in the United States."
  },
  {
    "n": 10,
    "title": "U.S. Sector-Specific Privacy: COPPA and FERPA",
    "math": "Privacy laws for children and students",
    "note": "This lesson covers two other key sector-specific US laws. The Children's Online Privacy Protection Act (COPPA) imposes requirements on websites directed to children under 13. The Family Educational Rights and Privacy Act (FERPA) protects the privacy of student education records."
  },
  {
    "n": 11,
    "title": "Financial and Corporate Governance Laws",
    "math": "Financial and corporate regulation",
    "note": "This lesson covers major laws with significant data security implications. It introduces the Sarbanes-Oxley Act (SOX), which requires internal controls for financial reporting at public companies, and the Gramm-Leach-Bliley Act (GLBA), which requires financial institutions to protect consumer financial privacy."
  },
  {
    "n": 12,
    "title": "The Payment Card Industry Data Security Standard (PCI DSS)",
    "math": "Financial data security standard",
    "note": "This lesson covers PCI DSS, a set of security standards designed to ensure that all companies that accept, process, store, or transmit credit card information maintain a secure environment. It is not a law, but a binding contractual requirement."
  },
  {
    "n": 13,
    "title": "Compliance Frameworks: NIST and ISO 27001",
    "math": "Information security standards",
    "note": "This section introduces compliance frameworks as structured sets of guidelines. It provides an overview of the NIST Cybersecurity Framework and the ISO/IEC 27001 standard for information security management systems (ISMS), which help organizations manage their security posture."
  },
  {
    "n": 14,
    "title": "Corporate Security Policies",
    "math": "Corporate governance",
    "note": "This section explains the importance of having formal, written information security policies within an organization. It covers the purpose of a high-level Information Security Policy and more specific policies like the Acceptable Use Policy (AUP)."
  },
  {
    "n": 15,
    "title": "Incident Response Planning and Notification",
    "math": "Incident response",
    "note": "This lesson emphasizes the legal and business need for a formal Incident Response Plan (IRP). It also covers the legal requirements for data breach notification, which vary by jurisdiction and dictate when and how a company must inform affected individuals and regulators."
  },
  {
    "n": 16,
    "title": "Digital Forensics and Evidence",
    "math": "Legal evidence procedures",
    "note": "A lesson on the legal aspects of digital evidence. It covers the importance of evidence admissibility in court, proper collection procedures, and maintaining a verifiable chain of custody to ensure the integrity of the evidence."
  },
  {
    "n": 17,
    "title": "Contracts and Service Level Agreements (SLAs)",
    "math": "Contract law",
    "note": "This lesson explains how legal documents are used to define security requirements between parties. It covers the role of contracts and SLAs in specifying security obligations, liability, and performance metrics, for example, between a company and a cloud service provider."
  },
  {
    "n": 18,
    "title": "Professional Ethics in Security",
    "math": "Codes of ethics",
    "note": "This section discusses the ethical responsibilities of information security professionals. It covers professional codes of conduct, such as those from (ISC)², which require members to act honorably, honestly, justly, responsibly, and legally. The ethics of vulnerability disclosure are explored."
  },
  {
    "n": 19,
    "title": "Legal Issues in Cloud Computing and IoT",
    "math": "Data sovereignty and liability",
    "note": "This lesson explores the legal complexities introduced by modern technologies. A key issue is data sovereignty (data is subject to the laws of the country where it is located). It also covers liability issues related to the failure of IoT devices."
  },
  {
    "n": 20,
    "title": "The Future of Cyber Law",
    "math": "Emerging legal topics",
    "note": "This final lesson looks at future legal and ethical challenges. It touches on emerging topics like the legal personality and liability of AI systems, the regulation of cryptocurrencies, and the ongoing global debate between government surveillance and individual privacy."
  }
]
