[
  {
    "n": 1,
    "title": "What Is Jira?",
    "math": "Project management software",
    "note": "This section introduces Jira as a powerful software application used for bug tracking, issue tracking, and agile project management. It explains that Jira is highly configurable and is used by development teams to plan, track, and release software."
  },
  {
    "n": 2,
    "title": "Jira Products: Software, Service Management, and Work Management",
    "math": "Product lines",
    "note": "This lesson clarifies the different products in the Jira family. It focuses on Jira Software (designed for software development teams) but also introduces Jira Service Management (for IT service desks) and Jira Work Management (for business teams), explaining their distinct purposes."
  },
  {
    "n": 3,
    "title": "Key Concepts: Projects, Issues, and Workflows",
    "math": "Core entities",
    "note": "This section defines the fundamental building blocks of Jira. A 'Project' is a container for work. An 'Issue' is a single work item within a project (like a bug, a task, or a user story). A 'Workflow' is the set of statuses and transitions that an issue moves through from creation to completion."
  },
  {
    "n": 4,
    "title": "Creating Your First Jira Project",
    "math": "Project setup",
    "note": "This lesson provides a practical guide to creating a new project in Jira. It explains the difference between the 'Kanban' and 'Scrum' project templates and provides guidance on which to choose based on your team's methodology."
  },
  {
    "n": 5,
    "title": "Understanding Issue Types",
    "math": "Work item classification",
    "note": "This section details the different types of issues available in a typical Jira Software project. It explains the hierarchy: an 'Epic' is a large body of work, a 'Story' is a feature from the user's perspective, a 'Task' is a specific to-do item, and a 'Bug' is a problem that needs fixing."
  },
  {
    "n": 6,
    "title": "Creating and Managing an Issue",
    "math": "Data entry and management",
    "note": "This lesson walks through the process of creating a new issue. It covers filling out the key fields like Summary, Description, Assignee, and Priority. It also demonstrates how to add comments, attach files, and link the issue to other issues."
  },
  {
    "n": 7,
    "title": "Introduction to Kanban in Jira",
    "math": "Kanban methodology",
    "note": "This section introduces the Kanban methodology as a process for visualizing workflow, limiting work in progress, and maximizing efficiency. It explains how Jira's Kanban board is a tool for implementing this methodology."
  },
  {
    "n": 8,
    "title": "Using the Kanban Board",
    "math": "Visual workflow management",
    "note": "This lesson provides a guide to the Jira Kanban board. It explains how the columns on the board represent the stages of your workflow (e.g., 'To Do', 'In Progress', 'Done') and how issues (represented as cards) are moved from left to right as work is completed."
  },
  {
    "n": 9,
    "title": "Configuring Your Kanban Board",
    "math": "Board configuration",
    "note": "This section covers how to customize a Kanban board. It demonstrates how to map workflow statuses to columns and how to set Work in Progress (WIP) limits on columns, which is a core practice of Kanban to prevent bottlenecks."
  },
  {
    "n": 10,
    "title": "Introduction to Scrum in Jira",
    "math": "Scrum methodology",
    "note": "This lesson introduces the Scrum framework as an iterative approach to project management. It explains the core concepts of Sprints (fixed-length iterations), the Product Backlog, and the roles of the Scrum team, all within the context of how Jira supports this framework."
  },
  {
    "n": 11,
    "title": "The Product Backlog",
    "math": "Backlog grooming",
    "note": "This section focuses on the Backlog view in a Jira Scrum project. It is an ordered list of all the work to be done for the product. The lesson demonstrates how to create, prioritize (by dragging and dropping), and estimate issues in the backlog."
  },
  {
    "n": 12,
    "title": "Estimation with Story Points",
    "math": "Relative estimation",
    "note": "This lesson explains the concept of Story Points as a unit of relative effort used in Scrum to estimate the size of a user story. It is a measure of complexity, uncertainty, and effort, not a measure of time. Jira's 'Estimation' field is shown."
  },
  {
    "n": 13,
    "title": "Planning and Starting a Sprint",
    "math": "Sprint planning",
    "note": "This section demonstrates the process of Sprint Planning in Jira. It shows how to create a new Sprint, set its duration, and drag issues from the Backlog into the Sprint to form the Sprint Backlog. Starting the sprint moves the issues to the 'Active Sprints' board."
  },
  {
    "n": 14,
    "title": "Using the Active Sprints Board",
    "math": "Sprint tracking",
    "note": "This lesson provides a guide to the Active Sprints board, which is the Scrum team's view of all the work in the current sprint. Like the Kanban board, it has columns representing the workflow, and the team moves issues across the board throughout the sprint."
  },
  {
    "n": 15,
    "title": "Searching with JQL (Jira Query Language)",
    "math": "Query languages",
    "note": "This section introduces JQL as a powerful, structured query language for searching for issues in Jira. It provides a more advanced alternative to the basic search. The lesson covers the basic syntax, including fields, operators, and values (e.g., `project = 'PROJ' AND status = 'Done'`)."
  },
  {
    "n": 16,
    "title": "Saving Searches as Filters",
    "math": "Saved queries",
    "note": "This lesson explains how a JQL query can be saved as a 'filter'. This allows you to easily re-run the search later without retyping the query. Saved filters are also used to populate dashboards and boards."
  },
  {
    "n": 17,
    "title": "Dashboards and Gadgets",
    "math": "Data visualization",
    "note": "This section introduces Jira Dashboards as a way to create a high-level, visual overview of projects and work. It explains that dashboards are composed of 'gadgets', which are small, configurable widgets that can display information like a pie chart of issue statuses or the results of a saved filter."
  },
  {
    "n": 18,
    "title": "Scrum Reports: Burndown and Velocity",
    "math": "Agile metrics",
    "note": "This lesson covers two key reports for Scrum teams. The Burndown Chart shows the work remaining in a sprint, helping the team to see if they are on track. The Velocity Chart shows the average amount of work a team completes per sprint, which is useful for future sprint planning."
  },
  {
    "n": 19,
    "title": "Integrating Jira with Source Control",
    "math": "Toolchain integration",
    "note": "This section explains how to connect Jira to a version control system like GitHub or Bitbucket. It demonstrates how including an issue key (e.g., 'PROJ-123') in a commit message or branch name automatically links the development work back to the Jira issue, providing traceability."
  },
  {
    "n": 20,
    "title": "Jira Administration: Workflows",
    "math": "Workflow customization",
    "note": "This final lesson provides an overview of project administration. It focuses on customizing workflows. It explains how an administrator can use the workflow editor to add new statuses and transitions, tailoring the issue lifecycle to match a team's specific process."
  }
]
