[
  {
    "n": 1,
    "title": "The Role of a Linux System Administrator",
    "math": "System administration",
    "note": "This section defines the role of a Linux System Administrator as a professional responsible for installing, configuring, and maintaining Linux operating systems and servers. It covers the key responsibilities, including user management, system security, performance monitoring, and ensuring system availability."
  },
  {
    "n": 2,
    "title": "The Command Line: Your Primary Tool",
    "math": "Command-line interfaces (CLI)",
    "note": "This lesson emphasizes the importance of the command line (or shell) for system administration. It explains that while GUIs exist, the CLI provides more power, flexibility, and the ability to automate tasks through scripting. The Bash shell is introduced as the most common."
  },
  {
    "n": 3,
    "title": "User and Group Management",
    "math": "User account management",
    "note": "This section covers the fundamental task of managing user accounts. It explains the concepts of users and groups and introduces the commands for creating, modifying, and deleting users (`useradd`, `usermod`, `userdel`) and groups. The `/etc/passwd`, `/etc/shadow`, and `/etc/group` files are explained."
  },
  {
    "n": 4,
    "title": "Privilege Escalation with `sudo`",
    "math": "Access control",
    "note": "This section covers the `sudo` command, the standard way to run commands with administrative (root) privileges. It explains the importance of not logging in as the root user directly and how to configure the `/etc/sudoers` file."
  },
  {
    "n": 5,
    "title": "The Linux File System Hierarchy (FHS)",
    "math": "File system hierarchy",
    "note": "This lesson explains the Filesystem Hierarchy Standard (FHS), which defines the directory structure in Linux. It covers the purpose of key directories like `/bin`, `/etc`, `/home`, `/var`, and `/usr`."
  },
  {
    "n": 6,
    "title": "File Permissions and Ownership",
    "math": "File system permissions",
    "note": "This section details the Linux file permission model (read, write, execute for user, group, and other). It demonstrates how to view permissions with `ls -l` and change them with `chmod` (using both symbolic and octal notation)."
  },
  {
    "n": 7,
    "title": "Process Management",
    "math": "Process control",
    "note": "This section introduces the concept of a process. It covers how to view running processes using `ps` and `top`, and how to send signals to manage them using the `kill` command (e.g., `SIGTERM`, `SIGKILL`)."
  },
  {
    "n": 8,
    "title": "Package Management: APT and DNF/YUM",
    "math": "Package management systems",
    "note": "This section explains how to manage software using a package manager. It contrasts Debian-based systems (`apt`) and Red Hat-based systems (`yum`/`dnf`). The commands for installing, updating, and removing software are demonstrated."
  },
  {
    "n": 9,
    "title": "Service Management with `systemd`",
    "math": "Init systems",
    "note": "This lesson introduces `systemd` as the modern standard for managing system services (daemons). It covers using `systemctl` to `start`, `stop`, `restart`, `status`, `enable`, and `disable` services."
  },
  {
    "n": 10,
    "title": "Network Configuration and Troubleshooting",
    "math": "Network configuration",
    "note": "This lesson covers basic Linux networking. It introduces the `ip` command for viewing and configuring network interfaces, `/etc/resolv.conf` for DNS, and the `ping` and `traceroute` commands for troubleshooting."
  },
  {
    "n": 11,
    "title": "Storage: Partitioning and Mounting",
    "math": "File system mounting",
    "note": "This lesson introduces commands for monitoring disk space (`df`, `du`). It then explains how to partition a disk with `fdisk` or `parted` and how to mount a file system using the `mount` command and the `/etc/fstab` file for persistence."
  },
  {
    "n": 12,
    "title": "Advanced Storage: RAID",
    "math": "Redundant Array of Independent Disks",
    "note": "A conceptual lesson on RAID. It explains the purpose of RAID and covers the most common levels: RAID 0 (striping), RAID 1 (mirroring), RAID 5 (striping with parity), and RAID 10 (striping and mirroring) and their trade-offs."
  },
  {
    "n": 13,
    "title": "Advanced Storage: Logical Volume Management (LVM)",
    "math": "Logical volume management",
    "note": "A dedicated lesson on LVM. It explains how LVM provides a layer of abstraction over physical disks, allowing for flexible volume creation, easy resizing, and snapshots. The concepts of Physical Volumes, Volume Groups, and Logical Volumes are detailed."
  },
  {
    "n": 14,
    "title": "System Logging",
    "math": "Log management",
    "note": "This lesson covers how to view and analyze system logs. It focuses on the modern `journalctl` command for interacting with the `systemd` journal, demonstrating how to filter logs by time, service, or priority."
  },
  {
    "n": 15,
    "title": "Automation: Shell Scripting",
    "math": "Scripting",
    "note": "This section provides an introduction to writing simple Bash scripts to automate repetitive administrative tasks. It covers variables, loops, and conditional statements within the context of a shell script."
  },
  {
    "n": 16,
    "title": "Automation: Task Scheduling with `cron`",
    "math": "Task scheduling",
    "note": "This lesson explains how to use the `cron` daemon to schedule scripts or other commands to run automatically at specific times or intervals. The syntax of a crontab file is detailed."
  },
  {
    "n": 17,
    "title": "Security: Firewalls",
    "math": "Firewall rules",
    "note": "This lesson introduces the concept of a host-based firewall. It provides an overview of common firewall management tools like `ufw` (Uncomplicated Firewall) and `firewalld` for defining rules to allow or block traffic."
  },
  {
    "n": 18,
    "title": "Security: SSH Hardening",
    "math": "Secure shell configuration",
    "note": "This lesson covers how to secure the Secure Shell (SSH) service for remote administration. Key practices like disabling root login, disabling password authentication in favor of key-based authentication, and changing the default port are explained."
  },
  {
    "n": 19,
    "title": "Advanced Security: SELinux and AppArmor",
    "math": "Mandatory Access Control (MAC)",
    "note": "A lesson introducing Mandatory Access Control. It conceptually explains how systems like SELinux (for Red Hat-based systems) and AppArmor (for Debian-based systems) provide more granular security policies by confining what processes are allowed to do."
  },
  {
    "n": 20,
    "title": "Performance Monitoring and Analysis",
    "math": "Performance analysis",
    "note": "A lesson that goes beyond `top`. It introduces other key command-line tools for diagnosing performance issues, such as `vmstat` (for virtual memory statistics), `iostat` (for storage I/O), and `ss` (for network socket statistics)."
  },
  {
    "n": 21,
    "title": "Backup and Recovery Strategies",
    "math": "Data backup",
    "note": "A practical lesson on system backups. It introduces common backup tools like `tar` and `rsync` and discusses different backup strategies, such as creating full, incremental, and differential backups."
  }
]
