[
  {
    "n": 1,
    "title": "Networking Roles and Topologies",
    "math": "networking roles, client-server, peer-to-peer, LAN, WAN, MAN, PAN, bus, star, ring, mesh, physical topology, logical topology",
    "note": "Explain client-server vs peer-to-peer, and compare LAN/WAN scopes and common topologies (bus, star, ring, mesh) including physical vs logical layouts. Demonstrate using Cisco Packet Tracer 8.x or GNS3 on Windows 11/Ubuntu 22.04."
  },
  {
    "n": 2,
    "title": "Binary, Hex, and Data Units",
    "math": "binary, hexadecimal, bits, bytes, kibibyte, mebibyte, throughput, bandwidth, latency, goodput",
    "note": "Teach binary/hex conversions and relate bits/bytes to data rates. Contrast bandwidth, latency, and goodput with simple calculations. Use Python 3.11 REPL in Windows Terminal or Ubuntu 22.04."
  },
  {
    "n": 3,
    "title": "OSI Model Deep Dive",
    "math": "OSI layers, encapsulation, decapsulation, PDU types, services",
    "note": "Describe the seven OSI layers and PDU names. Map devices and protocols to layers. Use Wireshark 4 on Windows 11 to inspect a captured HTTP request and annotate each layer."
  },
  {
    "n": 4,
    "title": "TCP/IP Model Mapping",
    "math": "TCP/IP layers, protocol suite, OSI mapping",
    "note": "Explain the four/five-layer TCP/IP model, core protocols, and how it maps to OSI. Use Wireshark on Ubuntu 22.04 to correlate headers to TCP/IP layers."
  },
  {
    "n": 5,
    "title": "Encapsulation and PDUs",
    "math": "frames, packets, segments, encapsulation, MTU, MSS, fragmentation",
    "note": "Show how data is encapsulated into segments, packets, and frames. Demonstrate MTU, MSS, and fragmentation using ping with DF flag in PowerShell (Windows 11) and iputils (Ubuntu 22.04)."
  },
  {
    "n": 6,
    "title": "Ethernet and MAC Addressing",
    "math": "Ethernet II, MAC addressing, CSMA/CD, frame format",
    "note": "Detail Ethernet frame fields and MAC addressing. Explain CSMA/CD and full-duplex. Build a tiny GNS3 lab with Open vSwitch and FRRouting hosts; observe frames in Wireshark."
  },
  {
    "n": 7,
    "title": "IPv4 Addressing Basics",
    "math": "IPv4 classes, private ranges, APIPA, dotted decimal",
    "note": "Introduce IPv4 addressing, private ranges, and APIPA. Configure static IPv4 addresses on Windows 11 and Ubuntu 22.04 and verify with ipconfig and ip addr."
  },
  {
    "n": 8,
    "title": "Subnetting Fundamentals",
    "math": "subnet masks, binary math, borrowed bits, host counts, network ID, broadcast",
    "note": "Calculate subnets by hand: network ID, broadcast, and usable hosts. Practice with paper worksheets and validate using a short Python 3.11 script on Windows or Linux."
  },
  {
    "n": 9,
    "title": "CIDR and VLSM Planning",
    "math": "CIDR notation, VLSM, summarization, supernetting",
    "note": "Design a VLSM plan for diverse host counts and create route summaries. Use a spreadsheet template and verify with ipcalc on Ubuntu 22.04."
  },
  {
    "n": 10,
    "title": "IPv6 Addressing Basics",
    "math": "IPv6 notation, zero compression, address types, scope, multicast",
    "note": "Teach IPv6 notation (hextets, zero compression) and address scopes (global, link-local, unique-local, multicast). Configure static IPv6 on Ubuntu 22.04 and validate with ip -6 commands."
  },
  {
    "n": 11,
    "title": "IPv6 NDP and Autoconfiguration",
    "math": "NDP, SLAAC, DHCPv6, DAD, Router Advertisement",
    "note": "Explain NDP components, SLAAC vs DHCPv6, and duplicate address detection. In GNS3 with FRRouting, send router advertisements and inspect neighbor tables on Linux hosts."
  },
  {
    "n": 12,
    "title": "Ports and Protocols",
    "math": "TCP vs UDP, three-way handshake, connection states, well-known ports",
    "note": "Memorize and test common ports (DNS, DHCP, HTTP/S, SSH, RDP, SNMP). Use Wireshark and netcat on Windows 11 and Ubuntu to demonstrate TCP handshakes and UDP traffic."
  },
  {
    "n": 13,
    "title": "ARP and Neighbor Caches",
    "math": "ARP, gratuitous ARP, ARP cache, IPv6 neighbor cache",
    "note": "Describe ARP resolution, gratuitous ARP, and cache behavior; compare to IPv6 neighbor caches. Use arp -a on Windows and ip neigh/ndisc6 on Linux to observe entries."
  },
  {
    "n": 14,
    "title": "Switching Fundamentals",
    "math": "MAC learning, flooding, CAM table, collision domains",
    "note": "Explain MAC learning and forwarding behavior in switches. Build a three-switch lab in GNS3 with Open vSwitch and review CAM-like tables via ovs-appctl."
  },
  {
    "n": 15,
    "title": "VLANs and Trunking",
    "math": "VLANs, 802.1Q tagging, native VLAN, access port, trunk port",
    "note": "Create VLANs, set access/trunk ports, and configure native VLAN. Use Cisco IOSv or Open vSwitch in GNS3 and validate isolation with ping tests."
  },
  {
    "n": 16,
    "title": "Inter-VLAN Routing",
    "math": "router-on-a-stick, SVIs, default gateways",
    "note": "Route between VLANs using router-on-a-stick and switch virtual interfaces. Configure on Cisco IOSv in GNS3 and verify with traceroute and gateway checks."
  },
  {
    "n": 17,
    "title": "Spanning Tree Protocol",
    "math": "STP, RSTP, BPDUs, root bridge, port roles, port states",
    "note": "Prevent loops with STP/RSTP, choose a root bridge, and observe port roles/states. Use Cisco IOSv switches in GNS3 and show spanning-tree outputs."
  },
  {
    "n": 18,
    "title": "Link Aggregation (LACP)",
    "math": "802.3ad, LACP, EtherChannel, hashing algorithms",
    "note": "Bundle links with LACP for redundancy and throughput. Configure EtherChannel on Cisco IOSv in GNS3 and test failure scenarios by disabling member links."
  },
  {
    "n": 19,
    "title": "Wireless RF Basics",
    "math": "RF, wavelength, attenuation, multipath, SNR, modulation",
    "note": "Introduce RF concepts: path loss, multipath, and SNR. Visualize signals using Acrylic Wi-Fi Home or NetSpot on Windows 11."
  },
  {
    "n": 20,
    "title": "802.11 Standards and Channels",
    "math": "802.11 a/b/g/n/ac/ax, 2.4/5/6 GHz, channels, DFS, channel width",
    "note": "Compare Wi-Fi standards, channel planning, DFS, and channel widths. Configure SSIDs and channels on a SOHO AP UI and validate with a Wi-Fi analyzer app."
  },
  {
    "n": 21,
    "title": "Wireless Security Practices",
    "math": "WPA2, WPA3, PSK, 802.1X, EAP, SAE",
    "note": "Secure WLANs using WPA2/WPA3, PSK vs Enterprise (802.1X). Configure WPA2-Enterprise with FreeRADIUS on Ubuntu 22.04 and test authentication from a Windows 11 client."
  },
  {
    "n": 22,
    "title": "WAN Technologies Overview",
    "math": "leased lines, packet switching, circuit switching, SLAs, latency",
    "note": "Survey major WAN access types and their tradeoffs in cost, throughput, and latency. Use draw.io for diagrams and review real provider SLA examples."
  },
  {
    "n": 23,
    "title": "MPLS and Metro Ethernet",
    "math": "MPLS labels, L3VPN, QoS classes, MetroE E-Line/E-LAN",
    "note": "Explain provider MPLS/MetroE offerings and CE responsibilities. Simulate CE routers with FRRouting in GNS3 connected to a mock MPLS cloud."
  },
  {
    "n": 24,
    "title": "Broadband and Cellular Access",
    "math": "DSL, DOCSIS, FTTH, LTE, 5G, CGNAT",
    "note": "Contrast DSL, cable, fiber-to-the-home, and LTE/5G. Demonstrate CGNAT detection by comparing a public IP from a website vs your SOHO router status page."
  },
  {
    "n": 25,
    "title": "NAT and PAT",
    "math": "static NAT, dynamic NAT, PAT, hairpin NAT",
    "note": "Configure static NAT, dynamic NAT, and PAT including hairpinning. Use pfSense 2.7 in a virtual lab and verify translations with packet captures."
  },
  {
    "n": 26,
    "title": "DHCP and Relay",
    "math": "DORA, scopes, reservations, options, DHCP relay",
    "note": "Deploy an ISC DHCP server on Ubuntu 22.04, create scopes and options, set reservations, and configure a DHCP relay on a router. Validate leases and options."
  },
  {
    "n": 27,
    "title": "DNS Fundamentals",
    "math": "A/AAAA, CNAME, MX, TXT, SRV, recursion, caching, TTL",
    "note": "Operate BIND9 with forward and reverse zones; create A/AAAA, MX, CNAME, TXT, and SRV records. Test recursion and TTL with dig/nslookup on Windows/Linux."
  },
  {
    "n": 28,
    "title": "NTP and Time Sync",
    "math": "NTP hierarchy, stratum, client/server, authentication",
    "note": "Configure chrony on Ubuntu and Windows Time Service to sync with pool.ntp.org. Verify offsets and secure with NTP authentication keys."
  },
  {
    "n": 29,
    "title": "AAA and Directory Services",
    "math": "RADIUS, TACACS+, LDAP, Kerberos, SSO",
    "note": "Implement AAA using FreeRADIUS and tac_plus on Ubuntu 22.04; integrate OpenLDAP; test device authentication from a Cisco IOSv router."
  },
  {
    "n": 30,
    "title": "Firewalls and ACLs",
    "math": "stateless vs stateful, zones, rule order, implicit deny",
    "note": "Create firewall policies on pfSense and compare with Cisco IOS extended ACLs. Test rule order, logging, and implicit deny using test hosts."
  },
  {
    "n": 31,
    "title": "IDS/IPS and WAF",
    "math": "signature-based, anomaly-based, inline vs TAP, WAF rules",
    "note": "Deploy Suricata IDS on Ubuntu; enable community rules and generate test alerts. Discuss managed WAF options using AWS WAF/Azure Front Door examples."
  },
  {
    "n": 32,
    "title": "Load Balancers and Proxies",
    "math": "L4 vs L7, persistence, health checks, reverse proxy, SSL offload",
    "note": "Configure HAProxy on Ubuntu to balance HTTP backends with health checks and sticky sessions. Validate with curl and browser tests."
  },
  {
    "n": 33,
    "title": "QoS Fundamentals",
    "math": "DSCP, CoS, queuing, policing, shaping, WRED",
    "note": "Classify and mark traffic, apply queuing, policing, and shaping. Use Cisco IOSv in GNS3 to configure MQC policies and test with iperf3 flows."
  },
  {
    "n": 34,
    "title": "High Availability Gateways",
    "math": "HSRP, VRRP, preemption, tracking, failover",
    "note": "Configure HSRP/VRRP on two routers and enable preemption and interface tracking. Test gateway failover using continuous pings in GNS3."
  },
  {
    "n": 35,
    "title": "Routing Basics and Static Routes",
    "math": "longest-prefix match, static routes, default route, admin distance",
    "note": "Explain longest-prefix match and configure static/default routes. Use FRRouting routers and Linux hosts to verify paths with traceroute and ip route get."
  },
  {
    "n": 36,
    "title": "RIP for Education",
    "math": "RIP v2, split horizon, poison reverse, timers",
    "note": "Enable RIP v2 in a small FRRouting topology to illustrate distance-vector metrics and convergence timers; observe route poisoning behavior."
  },
  {
    "n": 37,
    "title": "OSPF Fundamentals",
    "math": "OSPF areas, metrics, adjacencies, DR/BDR, LSAs",
    "note": "Configure single-area OSPF with FRRouting; observe neighbor states, DR/BDR elections, and LSDB contents; change interface costs and watch route selection."
  },
  {
    "n": 38,
    "title": "BGP Essentials",
    "math": "eBGP, iBGP, ASNs, path selection, attributes",
    "note": "Establish an eBGP peering between FRRouting routers, advertise prefixes, and influence paths with weight, local-preference, and AS-PATH prepending."
  },
  {
    "n": 39,
    "title": "Route Redistribution and Filtering",
    "math": "redistribution, route-maps, prefix-lists, tags, filtering",
    "note": "Redistribute between OSPF and BGP in FRRouting using route-maps and prefix-lists; apply route tags to avoid feedback loops."
  },
  {
    "n": 40,
    "title": "Segmentation with VRFs",
    "math": "VRF, routing instances, overlapping IP, route leaking",
    "note": "Create VRFs on Cisco IOSv or Linux network namespaces to isolate tenants; selectively leak routes for shared services and test isolation."
  },
  {
    "n": 41,
    "title": "SDN Concepts",
    "math": "control plane, data plane, southbound APIs, OpenFlow, intent",
    "note": "Introduce SDN architectures and controller roles. Use Open vSwitch with the Ryu controller on Ubuntu to push simple OpenFlow rules."
  },
  {
    "n": 42,
    "title": "SD-WAN Fundamentals",
    "math": "overlay, underlay, control plane, path selection, policies",
    "note": "Explain SD-WAN overlays, control policies, and dynamic path selection. Simulate dual-ISP underlays in GNS3 and observe policy-based failover."
  },
  {
    "n": 43,
    "title": "Virtualization and vSwitches",
    "math": "type 1 vs type 2, vNICs, virtual switches, SR-IOV",
    "note": "Build a lab in VMware Workstation or VirtualBox with multiple VMs; configure Linux bridge or Open vSwitch and test inter-VM connectivity."
  },
  {
    "n": 44,
    "title": "Cloud Networking Models",
    "math": "IaaS, PaaS, SaaS, public, private, hybrid, shared responsibility",
    "note": "Define cloud service/deployment models and shared responsibility. Use AWS and Azure portals (free tiers) to identify networking components in sample deployments."
  },
  {
    "n": 45,
    "title": "AWS VPC Networking",
    "math": "VPC, subnets, route tables, IGW, NAT gateway, security groups, NACLs",
    "note": "Create a VPC with public/private subnets, IGW, NAT gateway, security groups, and NACLs in AWS Console; test EC2 connectivity with ping and curl."
  },
  {
    "n": 46,
    "title": "Azure VNet Networking",
    "math": "VNet, subnets, NSGs, UDR, peering, Bastion",
    "note": "Deploy a VNet, subnets, NSGs, and user-defined routes in Azure; peer two VNets and validate connectivity via Azure Cloud Shell."
  },
  {
    "n": 47,
    "title": "Hybrid Connectivity Options",
    "math": "IPsec site-to-site, SSL VPN, Direct Connect, ExpressRoute",
    "note": "Set up a site-to-site IPsec VPN between pfSense and AWS. Contrast this with Direct Connect/ExpressRoute features and typical use cases."
  },
  {
    "n": 48,
    "title": "Automation Basics and APIs",
    "math": "REST, JSON, YAML, CRUD, idempotence, API clients",
    "note": "Explain RESTful APIs and data formats. Use Postman against a network API sandbox (Cisco DevNet) and parse JSON in Python 3.11."
  },
  {
    "n": 49,
    "title": "Ansible for Network Automation",
    "math": "inventory, modules, playbooks, Jinja2, idempotence",
    "note": "Install Ansible 2.15 on Ubuntu; write playbooks using network modules and Jinja2 templates to configure Cisco IOSv/Arista EOS (containerlab or GNS3)."
  },
  {
    "n": 50,
    "title": "Python Network Scripting",
    "math": "Netmiko, Paramiko, NAPALM, loops, exceptions",
    "note": "Create Python 3.11 scripts with Netmiko/NAPALM to gather device facts and push safe changes; add logging and exception handling. Run from Ubuntu or Windows."
  },
  {
    "n": 51,
    "title": "Terraform for Networking",
    "math": "providers, state, plans, modules, IaC",
    "note": "Provision AWS VPC networking with Terraform 1.x. Use providers, plans, remote state, and modules to standardize network deployments."
  },
  {
    "n": 52,
    "title": "Monitoring with SNMP and Syslog",
    "math": "SNMP v2c/v3, OIDs, traps, syslog severities, MIBs",
    "note": "Deploy Net-SNMP and syslog-ng on Ubuntu; poll device metrics, receive traps, and forward logs into Graylog for dashboards and alerts."
  },
  {
    "n": 53,
    "title": "Flow Analysis",
    "math": "NetFlow, sFlow, IPFIX, exporters, collectors, top talkers",
    "note": "Enable flow export on FRRouting/Cisco IOSv and collect with nfdump or pmacct. Analyze top talkers, applications, and conversations."
  },
  {
    "n": 54,
    "title": "Wireshark Packet Analysis",
    "math": "capture filters, display filters, TCP analysis, follow streams",
    "note": "Capture traffic with Wireshark 4 on Windows 11; apply capture/display filters, follow TCP streams, and use conversation statistics to identify latency and retransmissions."
  },
  {
    "n": 55,
    "title": "Troubleshooting Methodology",
    "math": "identification, hypothesis, testing, remediation, verification, documentation",
    "note": "Teach a structured troubleshooting process from identification to documentation with clear steps. Use GLPI or Spiceworks to track a mock ticket and actions taken."
  },
  {
    "n": 56,
    "title": "CLI Troubleshooting Tools",
    "math": "ping, traceroute, ipconfig/ifconfig/ip, netstat, nslookup/dig, arp, mtr",
    "note": "Demonstrate core tools on Windows and Linux to isolate DNS, gateway, routing, and ARP issues. Practice interpreting outputs and resolving simple faults."
  },
  {
    "n": 57,
    "title": "Copper Cabling and Connectors",
    "math": "UTP/STP, Cat5e/6/6A/7/8, T568A/B, RJ-45, punchdown, patch panels",
    "note": "Identify copper media and termination standards. Practice punching down keystones and patch panels with a lab kit and verify with a basic Fluke cable tester."
  },
  {
    "n": 58,
    "title": "Fiber and Transceivers",
    "math": "SMF vs MMF, LC/SC/ST, SFP/SFP+/QSFP, APC vs UPC, link budget",
    "note": "Explain fiber types and connector polish. Install SFP modules in lab switches and verify link power budgets and distances per datasheet."
  },
  {
    "n": 59,
    "title": "Cable Testing and Certification",
    "math": "continuity, wiremap, TDR, OTDR, NEXT, return loss, certification",
    "note": "Use a cable tester for continuity and wiremap. Discuss TDR/OTDR and interpret sample certification reports using Fluke LinkWare files."
  },
  {
    "n": 60,
    "title": "Documentation, Diagrams, and Change",
    "math": "network diagrams, IPAM, baselines, change control, MOP, SOP",
    "note": "Create logical/physical diagrams in draw.io or Visio. Maintain IP addressing in NetBox and write a Method of Procedure for a routine change; run a mock change review."
  },
  {
    "n": 61,
    "title": "NAC and 802.1X",
    "math": "802.1X, EAP-TLS, PEAP, supplicant, authenticator, RADIUS, posture",
    "note": "Deploy FreeRADIUS on Ubuntu and configure 802.1X on a switchport; test EAP-TLS/PEAP with the Windows 11 supplicant and observe RADIUS logs."
  },
  {
    "n": 62,
    "title": "Zero Trust and Microsegmentation",
    "math": "zero trust, least privilege, microsegmentation, SDP, ZTNA",
    "note": "Define zero trust principles and implement microsegmentation with host firewalls. Configure Windows Defender Firewall and Linux nftables policies to restrict east-west traffic."
  },
  {
    "n": 63,
    "title": "Remote Access Methods",
    "math": "SSH, RDP, VPN clients, port forwarding, jump hosts",
    "note": "Secure remote management with SSH and RDP over VPN. Configure OpenVPN on Windows 11, set port forwarding, and access devices via a hardened jump box."
  },
  {
    "n": 64,
    "title": "Secure Management and OOB",
    "math": "SSH, HTTPS, SNMPv3, TACACS+, out-of-band, console servers",
    "note": "Harden management access using SSH/HTTPS and SNMPv3. Demonstrate out-of-band management using a simulated console server and separate management network in GNS3."
  },
  {
    "n": 65,
    "title": "Network Threats and DDoS",
    "math": "DoS, DDoS, amplification, reflection, spoofing, uRPF, RTBH",
    "note": "Explain common network attacks and mitigations including ACLs, uRPF, and remotely triggered blackhole (RTBH). Simulate benign load with iperf3 and observe device impact."
  },
  {
    "n": 66,
    "title": "Vulnerability Scanning and Patching",
    "math": "scanning, CVSS, remediation, patch management, exceptions",
    "note": "Run OpenVAS or Nessus Essentials against lab hosts; prioritize findings via CVSS and apply patches using apt and Windows Update. Document remediation plans."
  },
  {
    "n": 67,
    "title": "Incident Response Basics",
    "math": "preparation, identification, containment, eradication, recovery, lessons learned",
    "note": "Walk through incident response phases using a mock breach. Collect volatile
