[
  {
    "n": 1,
    "title": "Introduction to the OSI Model",
    "math": "Layered models, set theory",
    "note": "Explain the purpose of the 7-layer OSI model (Physical, Data Link, Network, Transport, Session, Presentation, Application) as a conceptual framework for understanding network communication. Each layer's function will be defined independently, using the analogy of sending a physical letter."
  },
  {
    "n": 2,
    "title": "The TCP/IP Model and OSI Comparison",
    "math": "Model mapping, comparative analysis",
    "note": "Describe the four layers of the TCP/IP model (Network Interface, Internet, Transport, Application) and map them to the seven layers of the OSI model. The focus will be on TCP/IP as the practical model used in modern networks, contrasting its structure with the OSI theoretical model."
  },
  {
    "n": 3,
    "title": "The Data Encapsulation Process",
    "math": "Data structures, nested objects",
    "note": "Illustrate the process of data encapsulation, explaining how data is wrapped with headers and trailers at each layer of the TCP/IP model as it moves down the protocol stack. Define the Protocol Data Units (PDUs): Segments, Packets, Frames, and Bits for their respective layers."
  },
  {
    "n": 4,
    "title": "Network Types and Physical Topologies",
    "math": "Graph theory, scale and scope",
    "note": "Define and differentiate between Local Area Networks (LANs), Wide Area Networks (WANs), and Metropolitan Area Networks (MANs) based on geographical scope. Introduce physical network topologies including star, bus, ring, and mesh, explaining their basic structures and data flow patterns using diagrams."
  },
  {
    "n": 5,
    "title": "Understanding Twisted-Pair Copper Cabling",
    "math": "Signal attenuation, frequency analysis",
    "note": "Detail the characteristics of unshielded (UTP) and shielded (STP) twisted-pair cabling used in Ethernet LANs. Cover cable categories like Cat 5e, Cat 6, and Cat 6a, explaining their bandwidth capabilities and how twisting wires reduces electromagnetic interference and crosstalk."
  },
  {
    "n": 6,
    "title": "Common Network Cable Connectors",
    "math": "Pinout diagrams, modular arithmetic",
    "note": "Identify and describe common copper cable connectors, focusing on the RJ45 for Ethernet and the RJ11 for telephone lines. Explain their pin configurations and show how to wire an RJ45 connector using the T568A and T568B wiring standards for creating straight-through and crossover cables."
  },
  {
    "n": 7,
    "title": "Introduction to Fiber Optic Cabling",
    "math": "Optics, light propagation",
    "note": "Explain the principles of fiber optic communication, detailing the components of a fiber cable (core, cladding, buffer). Differentiate between Single-Mode Fiber (SMF) for long-haul communication and Multi-Mode Fiber (MMF) for shorter distances within a campus or building."
  },
  {
    "n": 8,
    "title": "IPv4 Addressing Fundamentals",
    "math": "Binary notation, base conversion",
    "note": "Introduce the 32-bit structure of an IPv4 address, written in dotted-decimal notation. Explain the concept of network and host portions, and define the default address classes (A, B, C) and their corresponding default subnet masks. Practice converting 8-bit octets between binary and decimal."
  },
  {
    "n": 9,
    "title": "The Purpose and Function of a Subnet Mask",
    "math": "Boolean AND operations",
    "note": "Explain how a subnet mask is used to divide an IP address into its network and host portions. Demonstrate the binary ANDing process where a device uses its own IP address and subnet mask to determine if a destination IP is on the local network or a remote network."
  },
  {
    "n": 10,
    "title": "Fundamentals of IPv4 Subnetting",
    "math": "Powers of two, binary arithmetic",
    "note": "Teach the concept of subnetting as a way to divide a larger network into smaller, more efficient subnetworks. Explain how 'borrowing' bits from the host portion of an address extends the network portion, allowing for more network IDs from a single class-based network address."
  },
  {
    "n": 11,
    "title": "Practical IPv4 Subnet Calculation with CIDR",
    "math": "Logarithms, binary calculation",
    "note": "Provide a step-by-step method for calculating subnets using Classless Inter-Domain Routing (CIDR) notation (e.g., /26, /27). This includes determining the network address, first and last usable host addresses, and the broadcast address for a given subnet."
  },
  {
    "n": 12,
    "title": "Introduction to IPv6 Addressing",
    "math": "Hexadecimal numbering system",
    "note": "Introduce the 128-bit structure of an IPv6 address, written in hexadecimal notation. Explain the format, including the network prefix and interface ID. Teach the two rules for abbreviating IPv6 addresses: omitting leading zeros and using a double colon (::) for a single block of consecutive zeros."
  },
  {
    "n": 13,
    "title": "Comparing TCP and UDP Protocols",
    "math": "State machines, checksum algorithms",
    "note": "Differentiate between the Transmission Control Protocol (TCP) and User Datagram Protocol (UDP). Explain TCP as a connection-oriented, reliable protocol using a three-way handshake and acknowledgments, and UDP as a connectionless, best-effort protocol with low overhead."
  },
  {
    "n": 14,
    "title": "Essential Network Ports and Protocols",
    "math": "Integer mapping",
    "note": "Define common TCP/IP application layer protocols and their associated default port numbers. Cover HTTP (80), HTTPS (443), FTP (20, 21), SSH (22), DNS (53), DHCP (67, 68), and RDP (3389), explaining the purpose of each protocol in client-server communication."
  },
  {
    "n": 15,
    "title": "How Network Switches Operate",
    "math": "Hash tables, lookup tables",
    "note": "Explain the function of a Layer 2 switch in a LAN. Detail how a switch learns MAC addresses from incoming frames and builds a MAC address table. This table is used to make intelligent forwarding decisions, sending frames only to the destination port rather than broadcasting them."
  },
  {
    "n": 16,
    "title": "Virtual LANs (VLANs) for Network Segmentation",
    "math": "Set partitioning",
    "note": "Introduce Virtual LANs (VLANs) as a method for logically segmenting a physical LAN into multiple broadcast domains on a single switch. Explain how VLANs improve security and traffic management by isolating groups of devices regardless of their physical location."
  },
  {
    "n": 17,
    "title": "Preventing Loops with Spanning Tree Protocol (STP)",
    "math": "Graph algorithms (minimum spanning tree)",
    "note": "Explain the purpose of the Spanning Tree Protocol (STP) to prevent switching loops in networks with redundant paths. Describe how STP works by electing a root bridge and blocking redundant ports to create a single, loop-free logical topology, ensuring network stability."
  },
  {
    "n": 18,
    "title": "The Function of a Network Router",
    "math": "Pathfinding algorithms, longest prefix match",
    "note": "Define the role of a router as a Layer 3 device that connects different IP networks. Explain how a router uses a routing table to examine the destination IP address of a packet and determine the best path to forward it towards its destination."
  },
  {
    "n": 19,
    "title": "Comparing Static and Dynamic Routing",
    "math": "Decision theory",
    "note": "Differentiate between static routing, where routes are manually configured by an administrator, and dynamic routing, where routers automatically learn about remote networks from other routers using a routing protocol. Discuss the use cases, advantages, and disadvantages of each."
  },
  {
    "n": 20,
    "title": "Overview of Dynamic Routing Protocols",
    "math": "Dijkstra's algorithm, vector arithmetic",
    "note": "Provide a high-level overview of dynamic routing protocols. Compare distance-vector protocols (like RIP) which use hop count as a metric, with link-state protocols (like OSPF) which have a complete map of the network topology to make more intelligent routing decisions."
  },
  {
    "n": 21,
    "title": "Understanding 802.11 Wi-Fi Standards",
    "math": "Frequency modulation, signal-to-noise ratio",
    "note": "Describe the evolution of the IEEE 802.11 standards for wireless networking. Cover key standards like 802.11n, ac (Wi-Fi 5), and ax (Wi-Fi 6), comparing them based on frequency bands (2.4 GHz vs. 5 GHz), maximum speed, and technologies like MIMO and MU-MIMO."
  },
  {
    "n": 22,
    "title": "Securing Wireless Networks (WPA2/WPA3)",
    "math": "Cryptography, key exchange algorithms",
    "note": "Explain the importance of securing wireless networks. Detail the differences between the modern security protocols WPA2 and WPA3. Explain the use of PSK (Pre-Shared Key) for personal use and Enterprise mode (using a RADIUS server for authentication) for business environments."
  },
  {
    "n": 23,
    "title": "Cloud Computing Models (IaaS, PaaS, SaaS)",
    "math": "Resource allocation models",
    "note": "Define cloud computing and its main service models. Differentiate between Infrastructure as a Service (IaaS), Platform as a Service (PaaS), and Software as a Service (SaaS) by explaining what the customer manages versus what the cloud provider manages in each model."
  },
  {
    "n": 24,
    "title": "Public, Private, and Hybrid Cloud Deployments",
    "math": "Set theory (union, intersection)",
    "note": "Compare and contrast the three primary cloud deployment models: Public Cloud (e.g., AWS, Azure), Private Cloud (on-premises resources), and Hybrid Cloud (a mix of both). Discuss the key drivers for choosing each model, such as cost, security, and control."
  },
  {
    "n": 25,
    "title": "Fundamentals of Network Virtualization",
    "math": "Abstraction layers",
    "note": "Explain the concept of virtualization, focusing on how a hypervisor allows a single physical machine to host multiple virtual machines (VMs). Describe virtual networking components like virtual switches (vSwitch) and virtual NICs that enable communication between VMs and the physical network."
  },
  {
    "n": 26,
    "title": "Network Monitoring with SNMP",
    "math": "Data structures (Management Information Base)",
    "note": "Introduce the Simple Network Management Protocol (SNMP) as a standard for monitoring network devices. Explain the roles of the SNMP manager, SNMP agent, and the Management Information Base (MIB). Describe basic operations like GET requests and asynchronous TRAP messages."
  },
  {
    "n": 27,
    "title": "Centralized Logging with Syslog",
    "math": "Time-series data analysis",
    "note": "Explain the importance of network device logging for troubleshooting and security. Describe the Syslog protocol, which allows devices to send event messages to a central Syslog server. Cover message severity levels from Emergency (0) to Debug (7)."
  },
  {
    "n": 28,
    "title": "Key Network Performance Metrics",
    "math": "Statistical analysis (mean, median, jitter)",
    "note": "Define key metrics used to measure network performance. Explain bandwidth (theoretical capacity), throughput (actual data transfer rate), latency (delay), and jitter (variation in delay). Use the analogy of highway traffic to explain the difference between them."
  },
  {
    "n": 29,
    "title": "Concepts of High Availability and Redundancy",
    "math": "Probability, mean time between failures (MTBF)",
    "note": "Introduce high availability (HA) as a design principle to ensure network uptime. Explain how redundancy is used to achieve HA by implementing duplicate components, such as redundant power supplies, multiple uplinks via link aggregation (LAG), or failover router pairs using VRRP."
  },
  {
    "n": 30,
    "title": "Disaster Recovery and Business Continuity",
    "math": "Risk analysis, optimization",
    "note": "Differentiate between disaster recovery (restoring IT functions after a catastrophe) and business continuity (keeping business functions operational during a disruption). Explain key concepts like Recovery Point Objective (RPO), Recovery Time Objective (RTO), and the importance of data backups."
  },
  {
    "n": 31,
    "title": "The Importance of Network Documentation",
    "math": "Graph visualization",
    "note": "Explain the critical role of network documentation for operations and troubleshooting. Cover the types of documents that should be maintained, including physical and logical network diagrams, IP address schemas, device configurations, and standard operating procedures (SOPs)."
  },
  {
    "n": 32,
    "title": "The CIA Triad of Security",
    "math": "Information theory",
    "note": "Introduce the fundamental security model of the CIA Triad. Define Confidentiality (preventing unauthorized disclosure), Integrity (ensuring data is not altered), and Availability (ensuring data and services are accessible when needed). Provide a real-world example for each component."
  },
  {
    "n": 33,
    "title": "Implementing Network Access Control (NAC)",
    "math": "Policy-based logic",
    "note": "Explain Network Access Control (NAC) as a security approach that restricts unauthorized users and devices from network access. Describe how NAC solutions can perform health checks on devices (e.g., antivirus updates, OS patches) before granting access to a quarantine or production VLAN."
  },
  {
    "n": 34,
    "title": "AAA Security Framework",
    "math": "Access control matrices",
    "note": "Describe the AAA framework for controlling access: Authentication (proving identity), Authorization (defining permissions), and Accounting (tracking actions). Explain how protocols like RADIUS and TACACS+ are used to centralize AAA services for network devices."
  },
  {
    "n": 35,
    "title": "Recognizing Common Network Attacks",
    "math": "Game theory",
    "note": "Provide an overview of common network-based attacks. Define Denial-of-Service (DoS) attacks, man-in-the-middle (MITM) attacks where an attacker intercepts communication, and social engineering tactics like phishing. The context is threat awareness for a network administrator."
  },
  {
    "n": 36,
    "title": "Function of Firewalls and ACLs",
    "math": "Boolean logic, ordered set processing",
    "note": "Explain the role of a firewall as a network security device that filters traffic. Describe how firewalls use Access Control Lists (ACLs)—ordered sets of rules that permit or deny traffic based on source/destination IP, port number, and protocol—and the implicit deny principle."
  },
  {
    "n": 37,
    "title": "IDS vs. IPS for Threat Detection",
    "math": "Pattern recognition, anomaly detection",
    "note": "Differentiate between an Intrusion Detection System (IDS), which monitors traffic and sends alerts, and an Intrusion Prevention System (IPS), which can actively block malicious traffic. Explain signature-based (known attacks) vs. anomaly-based (unusual behavior) detection."
  },
  {
    "n": 38,
    "title": "Understanding Virtual Private Networks (VPNs)",
    "math": "Tunneling protocols, encryption algorithms",
    "note": "Explain the purpose of a VPN to create a secure, encrypted tunnel over an untrusted public network. Describe remote-access VPNs for individual users and site-to-site VPNs for connecting two networks. Mention protocols like IPsec and SSL/TLS used to build these tunnels."
  },
  {
    "n": 39,
    "title": "Physical Security of Network Devices",
    "math": "Risk management",
    "note": "Discuss the importance of physical security for protecting network infrastructure. Cover controls such as locked server rooms, equipment racks, video surveillance, and biometric access controls to prevent unauthorized physical access to routers, switches, and servers."
  },
  {
    "n": 40,
    "title": "A Structured Approach to Troubleshooting",
    "math": "Problem-solving algorithms, logical deduction",
    "note": "Introduce the CompTIA 7-step troubleshooting methodology: 1. Identify the problem. 2. Establish a theory. 3. Test the theory. 4. Establish a plan of action. 5. Implement the solution. 6. Verify full system functionality. 7. Document findings."
  },
  {
    "n": 41,
    "title": "Using `ping` and `tracert` for Connectivity Testing",
    "math": "Round-trip time calculation",
    "note": "Demonstrate using the `ping` command (via ICMP) to test IP reachability and measure latency. Explain how `traceroute` (or `tracert` on Windows) is used to map the Layer 3 path a packet takes through routers to a destination by using TTL values."
  },
  {
    "n": 42,
    "title": "Viewing IP Configuration with `ipconfig`/`ifconfig`",
    "math": "Data querying",
    "note": "Explain how to use `ipconfig` (Windows) and `ifconfig`/`ip` (Linux) to view the IP address, subnet mask, and default gateway of a local network adapter. Show how to use switches like `ipconfig /all` to see MAC address and DHCP server information."
  },
  {
    "n": 43,
    "title": "Querying DNS with `nslookup` and `dig`",
    "math": "Hierarchical database querying",
    "note": "Teach how to use the `nslookup` and `dig` command-line utilities to troubleshoot Domain Name System (DNS) issues. Demonstrate how to perform forward lookups (name to IP) and query specific DNS record types like A (address) and MX (mail exchanger)."
  },
  {
    "n": 44,
    "title": "Inspecting Connections with `netstat`",
    "math": "State analysis",
    "note": "Introduce the `netstat` command for displaying active network connections, listening ports, and routing tables on a local machine. Explain how to use flags like `-an` to show all connections with numerical addresses, which helps identify unusual network activity."
  },
  {
    "n": 45,
    "title": "Using Hardware Tools for Troubleshooting",
    "math": "Signal analysis",
    "note": "Describe common hardware tools for network technicians. Explain the function of a cable crimper for making Ethernet cables, a punchdown tool for patch panels, a tone generator and probe for tracing cables, and a cable tester for verifying pinouts and connectivity."
  },
  {
    "n": 46,
    "title": "Troubleshooting Common Wired Network Problems",
    "math": "Fault isolation",
    "note": "Outline a systematic approach to troubleshooting common wired connectivity problems. Cover issues like bad cables or ports, speed and duplex mismatches, VLAN misconfigurations, and IP address conflicts. Use the OSI model as a framework to isolate the problem layer."
  },
  {
    "n": 47,
    "title": "Troubleshooting Common Wireless Network Problems",
    "math": "Signal interference analysis",
    "note": "Discuss common issues affecting Wi-Fi networks. Cover problems like poor signal strength, radio frequency interference (RFI) from devices like microwaves, channel overlap in the 2.4 GHz band, and incorrect security key or authentication settings."
  },
  {
    "n": 48,
    "title": "Troubleshooting DNS and DHCP Issues",
    "math": "Root cause analysis",
    "note": "Explain how to diagnose common problems with core network services. For DHCP, cover client failure to obtain an IP address (APIPA) and rogue DHCP servers. For DNS, cover name resolution failures, incorrect DNS server settings, and clearing the local DNS cache."
  }
]
