[
  {
    "n": 1,
    "title": "Introduction to Test Case Management with TestRail",
    "math": "Test management",
    "note": "Explains the need for a Test Case Management tool and introduces TestRail as a web-based solution for managing test cases, plans, and results."
  },
  {
    "n": 2,
    "title": "Navigating the Dashboard and Projects",
    "math": "User interface tour",
    "note": "Provides a guided tour of the TestRail interface, including the main Dashboard for an overview and how to navigate into a specific Project."
  },
  {
    "n": 3,
    "title": "Organizing Test Cases in Suites and Sections",
    "math": "Hierarchical organization",
    "note": "Focuses on the 'Test Cases' tab. Explains how to use 'Test Suites' to group cases (e.g., by feature) and 'Sections' to create a folder-like hierarchy for organization."
  },
  {
    "n": 4,
    "title": "Creating and Importing Test Cases",
    "math": "Test case design",
    "note": "A practical guide to creating a test case with its standard fields (Title, Preconditions, Steps, Expected Result). Also covers bulk importing cases from a CSV file."
  },
  {
    "n": 5,
    "title": "Efficiently Managing Suites with Bulk Editing",
    "math": "Batch processing",
    "note": "Demonstrates the bulk edit feature, a crucial tool for maintaining large test suites. Covers selecting multiple test cases to move, copy, or edit their properties all at once."
  },
  {
    "n": 6,
    "title": "Test Case Versioning with Baselines",
    "math": "Version control",
    "note": "Introduces Test Case Baselines, which allow you to create a 'version' of your test suite. This is critical for projects with multiple releases in maintenance, as it lets you preserve the test suite as it was for a specific version while evolving it for the next."
  },
  {
    "n": 7,
    "title": "Creating a Test Run",
    "math": "Test execution planning",
    "note": "Introduces the 'Test Runs & Results' tab. Demonstrates how to create a Test Run by selecting which test cases to include, either all cases or a specific subset."
  },
  {
    "n": 8,
    "title": "Executing Tests and Adding Results",
    "math": "Test execution",
    "note": "Walks through the process of executing a test. Details the different statuses ('Passed', 'Failed', 'Blocked') and shows how to add comments and attach files like screenshots."
  },
  {
    "n": 9,
    "title": "Grouping Runs with Test Plans",
    "math": "Test planning",
    "note": "Introduces Test Plans as a way to group multiple Test Runs together, typically to manage the entire testing effort for a milestone or release."
  },
  {
    "n": 10,
    "title": "Managing Test Configurations",
    "math": "Combinatorics",
    "note": "Explains the powerful 'Configurations' feature within Test Plans. This allows you to create groups of test runs against different environments (e.g., Browsers: Chrome, Firefox; OS: Windows, macOS) and track results for each combination."
  },
  {
    "n": 11,
    "title": "Tracking Progress with Milestones",
    "math": "Milestone tracking",
    "note": "Explains how to use Milestones to track major project phases. You can associate Test Plans with a milestone to get a high-level view of progress toward a release."
  },
  {
    "n": 12,
    "title": "The 'Todos' Page for Task Management",
    "math": "Task management",
    "note": "Explains the 'Todos' page, which acts as a personal dashboard showing all tests assigned to you across all projects, making it easy to see your current workload."
  },
  {
    "n": 13,
    "title": "Integration with Issue Trackers (e.g., Jira)",
    "math": "Toolchain integration",
    "note": "Covers the importance of integrating with an issue tracker. Demonstrates how to 'Push' a defect from a failed test result in TestRail to automatically create a bug report in Jira."
  },
  {
    "n": 14,
    "title": "Reporting and Metrics",
    "math": "Test reporting",
    "note": "Covers TestRail's built-in reporting capabilities to generate summaries of test plans and runs, which can be used to communicate status to stakeholders."
  },
  {
    "n": 15,
    "title": "Custom Reports and Dashboards",
    "math": "Data visualization",
    "note": "Explores advanced reporting. Covers how to create custom reports to meet specific needs, schedule reports to be sent automatically, and customize the project dashboard with charts to provide a real-time view of testing progress."
  },
  {
    "n": 16,
    "title": "Introduction to the TestRail API",
    "math": "API for test automation",
    "note": "Provides a high-level overview of the TestRail API, explaining its role in integrating automated tests with TestRail for centralized reporting."
  },
  {
    "n": 17,
    "title": "Practical API Usage: Adding a Test Result",
    "math": "API programming",
    "note": "Demonstrates a conceptual code example (e.g., in Python) showing how an automated test script would use the API to find a test case and post a result (e.g., 'Passed' or 'Failed') back to a specific Test Run in TestRail."
  },
  {
    "n": 18,
    "title": "Administration: Customizing Fields",
    "math": "Customization",
    "note": "Covers how administrators can add custom fields to test cases, results, or projects to capture information specific to a team's workflow."
  },
  {
    "n": 19,
    "title": "Administration: Managing Users and Roles",
    "math": "User administration",
    "note": "Provides an overview of user management. Shows how administrators can add users, organize them into groups, and assign roles and permissions to control access."
  }
]
