[
  {
    "n": 1,
    "title": "Introduction to Wireless Networking",
    "math": "Wireless communication",
    "note": "Provides a basic overview of Wi-Fi (IEEE 802.11), explaining the roles of access points and clients. Introduces the inherent security risk of broadcasting data over the air."
  },
  {
    "n": 2,
    "title": "Wi-Fi Security Protocols (WEP, WPA, WPA2, WPA3)",
    "math": "Encryption standards (RC4, TKIP, AES)",
    "note": "Covers the evolution of Wi-Fi security. Explains why WEP (RC4) and WPA (TKIP) are deprecated and insecure, and why WPA2 (AES) is the minimum standard. Introduces WPA3's improvements, like SAE."
  },
  {
    "n": 3,
    "title": "WPA-Personal vs. WPA-Enterprise",
    "math": "Authentication methods",
    "note": "Contrasts the two main modes. WPA-Personal uses a single Pre-Shared Key (PSK) for everyone. WPA-Enterprise is for corporate environments and authenticates each user individually."
  },
  {
    "n": 4,
    "title": "WPA-Enterprise, 802.1X, and RADIUS",
    "math": "Network access control",
    "note": "A deeper dive into WPA-Enterprise. Explains the roles of the Supplicant (client), Authenticator (Access Point), and Authentication Server (typically RADIUS) in the 802.1X framework."
  },
  {
    "n": 5,
    "title": "Extensible Authentication Protocol (EAP) Types",
    "math": "Authentication protocols",
    "note": "Explains that 802.1X is a framework that uses an EAP method for the actual authentication. Contrasts common types like EAP-TLS (highly secure, uses client/server certificates) and PEAP (common, uses a server certificate and username/password)."
  },
  {
    "n": 6,
    "title": "Wireless Attack: Packet Sniffing",
    "math": "Eavesdropping",
    "note": "Explains how an attacker can capture and read all data on an open (unencrypted) Wi-Fi network using tools like Wireshark. Emphasizes the need for end-to-end encryption like HTTPS."
  },
  {
    "n": 7,
    "title": "Wireless Attack: The 'Evil Twin' Attack",
    "math": "Impersonation attacks",
    "note": "Details the 'Evil Twin' attack, where an attacker sets up a fraudulent Wi-Fi access point with a legitimate-sounding name to trick users into connecting and intercept their traffic."
  },
  {
    "n": 8,
    "title": "Wireless Attack: Deauthentication Attack",
    "math": "Denial-of-service attacks",
    "note": "Explains the deauthentication attack, where an attacker sends spoofed frames to disconnect a client from an access point, disrupting service or enabling other attacks."
  },
  {
    "n": 9,
    "title": "Wireless Attack: Cracking WPA/WPA2 Passwords",
    "math": "Brute-force attacks",
    "note": "Explains how attackers capture the WPA 4-way handshake and use offline brute-force or dictionary attacks with tools like Aircrack-ng to crack weak pre-shared keys."
  },
  {
    "n": 10,
    "title": "Overview of Wireless Hacking Tools",
    "math": "Offensive security tools",
    "note": "Provides a brief overview of common tools used by attackers and pentesters. Introduces the Aircrack-ng suite for cracking, Kismet for network discovery, and the Wi-Fi Pineapple as a hardware platform for rogue AP/evil twin attacks."
  },
  {
    "n": 11,
    "title": "Wireless Intrusion Detection and Prevention Systems (WIDS/WIPS)",
    "math": "Threat detection",
    "note": "Introduces WIDS/WIPS as enterprise tools that monitor the radio spectrum for malicious activity. Explains their role in detecting rogue access points, evil twins, and other wireless attacks."
  },
  {
    "n": 12,
    "title": "Understanding Captive Portals",
    "math": "User redirection",
    "note": "Explains how captive portals (public Wi-Fi logins) work by intercepting web traffic and redirecting users to a login page. Highlights that they do not provide encryption for the subsequent session."
  },
  {
    "n": 13,
    "title": "Best Practice: Use WPA3 or WPA2-AES",
    "math": "Security configuration",
    "note": "Emphasizes the most important security setting: always select WPA3 if available, or WPA2 with AES encryption. WEP, WPA, and WPA2-TKIP should never be used."
  },
  {
    "n": 14,
    "title": "Best Practice: Strong Passphrase and Admin Credentials",
    "math": "Password security",
    "note": "Highlights two critical password practices: using a long, complex passphrase for WPA-Personal, and immediately changing the default administrator password for the router's web interface."
  },
  {
    "n": 15,
    "title": "Best Practice: Disable WPS",
    "math": "Wi-Fi Protected Setup (WPS)",
    "note": "Advises disabling WPS, a feature designed for ease of use but whose PIN method is vulnerable to brute-force attacks that can reveal the main Wi-Fi password."
  },
  {
    "n": 16,
    "title": "Best Practice: Network Segmentation",
    "math": "Network segmentation",
    "note": "Explains the security benefit of using a Guest Network. This isolates less-trusted guests and IoT devices from your main network that contains sensitive computers and files."
  },
  {
    "n": 17,
    "title": "Securing Wireless IoT Devices",
    "math": "IoT security",
    "note": "Discusses the unique challenges of securing IoT devices, which often have poor security features. Emphasizes placing them on a segmented guest network and changing default passwords."
  },
  {
    "n": 18,
    "title": "Bluetooth Security",
    "math": "Bluetooth security",
    "note": "Provides an overview of Bluetooth security. Discusses the importance of the pairing process and threats like 'Bluesnarfing' (data theft) and 'Bluejacking' (spamming)."
  },
  {
    "n": 19,
    "title": "Mobile Network Security (4G/5G)",
    "math": "Cellular network security",
    "note": "Gives a high-level introduction to the security architecture of cellular networks. Mentions the role of the SIM card for authentication and the stronger, mutual authentication used in 4G/5G compared to older standards."
  },
  {
    "n": 20,
    "title": "Best Practices for Public Wi-Fi",
    "math": "Personal security",
    "note": "Provides actionable advice for users on public networks. Emphasizes treating all public Wi-Fi as hostile, verifying network names, and using a trusted VPN to encrypt all traffic."
  }
]
