[
  {
    "n": 1,
    "title": "Introduction to Wireless Networking",
    "math": "Wireless communication",
    "note": "This section provides a basic overview of how Wi-Fi works. It explains the roles of a Wireless Access Point (AP) and a client device, and how they communicate using radio waves based on the IEEE 802.11 family of standards. The inherent security risk of broadcasting data over the air is introduced."
  },
  {
    "n": 2,
    "title": "Legacy Security: WEP (Wired Equivalent Privacy)",
    "math": "Stream ciphers (RC4)",
    "note": "This lesson covers the first widely adopted Wi-Fi security protocol, WEP. It is presented as a historical example of a failed security standard. The lesson explains the serious cryptographic flaws in its implementation of the RC4 stream cipher that make it trivial to crack with modern tools."
  },
  {
    "n": 3,
    "title": "The First Improvement: WPA",
    "math": "Temporal Key Integrity Protocol (TKIP)",
    "note": "This section introduces Wi-Fi Protected Access (WPA) as a temporary, intermediate security standard designed to fix the most serious flaws in WEP. It explains that WPA introduced the Temporal Key Integrity Protocol (TKIP), which dynamically changed keys as the system was used, but it still retained some of WEP's underlying vulnerabilities."
  },
  {
    "n": 4,
    "title": "The Modern Standard: WPA2",
    "math": "Advanced Encryption Standard (AES)",
    "note": "This lesson introduces WPA2 as the long-time, secure standard for Wi-Fi. It explains that the major improvement in WPA2 was the mandatory use of the Advanced Encryption Standard (AES), a much stronger and more secure encryption algorithm, making it resistant to the attacks that plagued WEP and WPA."
  },
  {
    "n": 5,
    "title": "The Latest Standard: WPA3",
    "math": "Simultaneous Authentication of Equals (SAE)",
    "note": "This section covers the latest Wi-Fi security protocol, WPA3. It explains the key improvements over WPA2, including more robust protection against brute-force password guessing attacks (through a new handshake called Simultaneous Authentication of Equals) and individualized data encryption on open networks."
  },
  {
    "n": 6,
    "title": "WPA-Personal vs. WPA-Enterprise",
    "math": "Authentication methods",
    "note": "This lesson contrasts the two main modes of operation for WPA2/WPA3. WPA-Personal uses a Pre-Shared Key (PSK)—a single password that is shared among all users. WPA-Enterprise is designed for corporate environments and authenticates each user individually, typically by integrating with a RADIUS server."
  },
  {
    "n": 7,
    "title": "The WPA2-Personal Handshake",
    "math": "Four-way handshake",
    "note": "This section provides a high-level overview of the four-way handshake process used in WPA2-Personal. This is the process through which a client and an access point use the pre-shared key to prove to each other that they know the key, without ever revealing it, and to derive a fresh encryption key for the session."
  },
  {
    "n": 8,
    "title": "Wireless Attack: Packet Sniffing",
    "math": "Eavesdropping",
    "note": "This lesson explains the threat of packet sniffing on wireless networks. On an open (unencrypted) Wi-Fi network, all traffic is sent 'in the clear', and an attacker on the same network can easily capture and read all the data. This emphasizes the need for encryption."
  },
  {
    "n": 9,
    "title": "Wireless Attack: The 'Evil Twin' Attack",
    "math": "Impersonation attacks",
    "note": "This section details a common and effective wireless attack. An 'Evil Twin' is a fraudulent Wi-Fi access point that appears to be a legitimate one (e.g., 'Free_Airport_Wi-Fi'). Unsuspecting users connect to it, and the attacker, who controls the access point, can then monitor and intercept all their traffic."
  },
  {
    "n": 10,
    "title": "Wireless Attack: Deauthentication Attack",
    "math": "Denial-of-service attacks",
    "note": "This lesson explains the deauthentication attack, a type of denial-of-service attack. It works by sending spoofed 'deauthentication' frames to a client, which causes it to be disconnected from the access point. This attack can be used to disrupt service or as a precursor to other attacks."
  },
  {
    "n": 11,
    "title": "Wireless Attack: Cracking WPA/WPA2 Passwords",
    "math": "Brute-force attacks",
    "note": "This section explains how attackers can crack the pre-shared key (password) of a WPA/WPA2-Personal network. The process involves capturing the four-way handshake and then using an offline brute-force or dictionary attack with tools like Aircrack-ng to guess the password. This highlights the need for a strong passphrase."
  },
  {
    "n": 12,
    "title": "Best Practice: Use WPA2 or WPA3 Encryption",
    "math": "Security configuration",
    "note": "This lesson provides the most important practical advice for securing a Wi-Fi network. It emphasizes that you must use a strong encryption protocol. WEP and WPA should never be used, and WPA2-AES or WPA3 should always be selected in your router's configuration."
  },
  {
    "n": 13,
    "title": "Best Practice: Choose a Strong Passphrase",
    "math": "Password strength",
    "note": "This section explains that for WPA-Personal, the security of the entire network depends on the strength of the one shared passphrase. It recommends using a long, complex, and unique passphrase to make offline cracking attacks infeasible."
  },
  {
    "n": 14,
    "title": "Best Practice: Change Default Router Credentials",
    "math": "Default password security",
    "note": "This lesson covers a critical security step. All routers come with a default administrator username and password, which are publicly known. You must change these credentials immediately to prevent an attacker on your network from taking over your router."
  },
  {
    "n": 15,
    "title": "Best Practice: Disable WPS",
    "math": "Wi-Fi Protected Setup (WPS)",
    "note": "This section advises disabling WPS. Wi-Fi Protected Setup is a feature designed to make it easy to connect devices to a router, but several design flaws in its PIN-based method make it vulnerable to brute-force attacks, which can reveal the WPA2 passphrase."
  },
  {
    "n": 16,
    "title": "Best Practice: Keep Router Firmware Updated",
    "math": "Patch management",
    "note": "This lesson explains that, like any software, router firmware can have security vulnerabilities. It is crucial to regularly check for and install firmware updates from the manufacturer to protect against known exploits."
  },
  {
    "n": 17,
    "title": "The Myth of Hiding Your SSID",
    "math": "Security by obscurity",
    "note": "This section debunks a common but ineffective security tip. Hiding your network name (SSID) only prevents it from being broadcast, but it can still be easily discovered by a passive attacker. This provides no real security and is an example of 'security by obscurity'."
  },
  {
    "n": 18,
    "title": "Best Practice: Use a Guest Network",
    "math": "Network segmentation",
    "note": "This lesson explains the benefit of a guest network. Most modern routers allow you to create a separate guest Wi-Fi network that provides internet access but is isolated from your main internal network. This prevents guests or less secure IoT devices from accessing your trusted computers and files."
  },
  {
    "n": 19,
    "title": "Bluetooth Security",
    "math": "Bluetooth security",
    "note": "This section provides a brief overview of security for another common wireless technology, Bluetooth. It discusses the pairing process and common threats like 'Bluesnarfing' (unauthorized access to information) and 'Bluejacking' (sending unsolicited messages)."
  },
  {
    "n": 20,
    "title": "Securing Mobile Devices on Wireless Networks",
    "math": "Mobile security",
    "note": "This final lesson provides security tips for mobile devices. These include forgetting unused Wi-Fi networks, turning off auto-connect features, being cautious about the permissions that apps request, and using a VPN, especially when connecting to public hotspots."
  }
]
