[
  {
    "n": 1,
    "title": "Introduction to WordPress",
    "math": "Content Management Systems (CMS)",
    "note": "Explains WordPress as a CMS, covering the difference between WordPress.org (self-hosted) and WordPress.com (service). Sets the stage for using WordPress to manage a website."
  },
  {
    "n": 2,
    "title": "Local Development Setup",
    "math": "System configuration",
    "note": "A guide to installing WordPress locally using tools like XAMPP or Local by Flywheel. Covers creating a database and running the WordPress installation."
  },
  {
    "n": 3,
    "title": "Navigating the WordPress Dashboard",
    "math": "User interface tour",
    "note": "A guided tour of the WordPress admin dashboard, explaining the purpose of each main menu item from Posts and Pages to Settings and Plugins."
  },
  {
    "n": 4,
    "title": "Creating Content: Posts vs. Pages",
    "math": "Content types",
    "note": "Details the difference between time-based Posts and static Pages. Covers using the Gutenberg block editor, and organizing Posts with categories and tags."
  },
  {
    "n": 5,
    "title": "Managing Themes and the Customizer",
    "math": "Modular design",
    "note": "Explains how themes control a site's design. Covers installing themes and using the Theme Customizer to change visual settings like colors, fonts, and logos."
  },
  {
    "n": 6,
    "title": "Extending Functionality with Plugins",
    "math": "Modular functionality",
    "note": "Explains the role of plugins in adding new features. Demonstrates how to find, install, and manage plugins from the official repository."
  },
  {
    "n": 7,
    "title": "Managing Users, Comments, and Settings",
    "math": "Access control & Configuration",
    "note": "Covers user roles and permissions, comment moderation, and configuring essential site settings like Permalinks and Reading/Writing options."
  },
  {
    "n": 8,
    "title": "WordPress SEO, Security, and Maintenance",
    "math": "Optimization & Risk management",
    "note": "Covers three critical aspects of site ownership: basic SEO with a plugin, essential security practices (updates, strong passwords), and the importance of regular backups."
  },
  {
    "n": 9,
    "title": "Developer: The Template Hierarchy",
    "math": "Conditional logic tree",
    "note": "Introduces the core concept of theme development. Explains how WordPress uses a hierarchy of template files (e.g., `single.php`, `page.php`, `archive.php`, `index.php`) to decide which PHP file to use for rendering a specific page."
  },
  {
    "n": 10,
    "title": "Developer: The Loop",
    "math": "Iteration",
    "note": "Explains the standard PHP code block (`while ( have_posts() ) : the_post();`) that WordPress uses to display posts. This is the fundamental mechanism for outputting content in theme templates."
  },
  {
    "n": 11,
    "title": "Developer: Hooks (Actions and Filters)",
    "math": "Event-driven programming",
    "note": "Introduces the core of WordPress extensibility. Explains Action hooks (`add_action`) for running code at specific events and Filter hooks (`add_filter`) for modifying data before it's used."
  },
  {
    "n": 12,
    "title": "Developer: Child Themes",
    "math": "Inheritance",
    "note": "Explains why a child theme is the best practice for making custom modifications. Covers how to create a child theme to safely customize CSS or template files without losing changes when the parent theme is updated."
  },
  {
    "n": 13,
    "title": "Developer: Custom Post Types and Taxonomies",
    "math": "Custom data modeling",
    "note": "Covers how to go beyond Posts and Pages by registering your own Custom Post Types (e.g., 'Portfolio', 'Events') and custom taxonomies (e.g., 'Event Type') to create structured, bespoke websites."
  },
  {
    "n": 14,
    "title": "Developer: Introduction to the REST API",
    "math": "API design",
    "note": "Introduces the built-in WordPress REST API. Explains how it can be used to fetch content in JSON format, enabling 'headless' WordPress setups where the front-end is a separate JavaScript application."
  },
  {
    "n": 15,
    "title": "Developer: Managing WordPress with WP-CLI",
    "math": "Command-line interfaces",
    "note": "Introduces the WordPress Command-Line Interface (WP-CLI) as a powerful tool for developers and admins. Demonstrates common commands for installing/updating core, managing plugins, and running database operations."
  },
  {
    "n": 16,
    "title": "Developer: Introduction to Gutenberg Block Development",
    "math": "Component-based architecture",
    "note": "Provides a high-level overview of creating a custom block for the Gutenberg editor. Explains the basic concepts of using JavaScript (typically React) to define a block's structure, attributes, and behavior."
  },
  {
    "n": 17,
    "title": "Advanced: E-commerce with WooCommerce",
    "math": "Transaction processing",
    "note": "Provides an overview of turning a WordPress site into an online store using the WooCommerce plugin. Covers initial setup, adding products, and managing orders."
  },
  {
    "n": 18,
    "title": "Advanced: Performance Optimization",
    "math": "Performance analysis",
    "note": "Discusses key strategies for speeding up a WordPress site. Covers the importance of good hosting, implementing page caching with plugins, and optimizing images."
  }
]
